{
    "data": [
        {
            "slug": "sprint-1",
            "semesterClass": "semester-1-midterm",
            "articles": [
                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "4/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "wat heb ik vandaag gedaan?",
                            "text": "vandaag heb ik een breakdown schets gemaakt dat is een schets van de website die ik wil bouwen. met daarin elementen die ik zou kunnen gebruiken."
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb ook gewerkt aan mijn visitekaartje. Ik heb een list toegevoegd mbv. dt en dd Deze tags waren in de template code. Ik heb ze nu aangepast en op een nieuwe manier ingedeelt m.b.v. een ul."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat wil ik nog uitzoeken:",
                            "text": "in mijn list als ik hover over text wil ik een pop up tevoorschijn laten komen. In die pop up wil ik vertellen hoe ik de programeertaal heb geleerd en hoe goed ik ben daarin"
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a href='https://github.com/vsheo/your-tribe-profile-card/blob/main/visitekaart_bewijslast/breakdown_schets_v1.jpg'>breakdown schets 1 en 2</a><a href='https://github.com/vsheo/your-tribe-profile-card/blob/main/visitekaart_bewijslast/breakdown_schets_v2.jpg'>breakdown schets 3</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "8/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "wat heb ik vandaag gedaan?",
                            "text": "Vandaag heb ik gewerkt aan mijn I love web. Ik heb de structuur ingedeeld. Ik wil nog niet teveel zetten omdat ik weet dat ik meer zal leren over html en css. Ik wil niet vanaf het begin iets hebben dat moeilijk te lezen is, daarom heb ik het voor nu simpel gehouden."
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb nu een home pagina, en een semester pagina waar alle sprints voor semester 1 staan. Ik kan nu mijn day journal bijhouden en foto's toevoegen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat wil ik nog doen?",
                            "text": "Ik ben van plan om elke dag screenshots te maken voor een time vault, zodat ik kan zien hoe de website door de dagen heen veranderd."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "9/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat hebben we gedaan?",
                            "text": "team gemaakt met Dylan en Colin voor de squad page groeps opdracht. op <a href='https://miro.com/app/board/uXjVKh1tR08=/'>miro</a> doelen en regels voor het project gemaakt"
                        },
                        {
                            "type": "paragraph",
                            "text": "iedereen heeft een paar breakdown schetsen gemaakt. Daarna hebben we overlegd en geprobeerd om de ideeën van elkaar te combineren voor een final versie van de breakdown schetsen"
                        },
                        {
                            "type": "paragraph",
                            "text": "Daarna ben ik alvast begonnen met het bouwen van de squad page. Ik heb nu de grid layout voor onze foto's."
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target='blank' href='https://github.com/vsheo/your-tribe-profile-card/blob/main/squad_page_bewijslast/squad_page_breakdown_v2.jpg'>breakdown schets squad page individueel</a><a target='blank' href='https://github.com/vsheo/your-tribe-profile-card/blob/main/squad_page_bewijslast/squad_page_breakdown_v3.jpg'>breakdown schets squad page samengevoegd</a><a target='blank' href='https://github.com/vsheo/your-tribe-profile-card/blob/main/squad_page_bewijslast/squad_page_v1.png'>squad page versie 1</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "10/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "wat heb ik geleerd?",
                            "text": "Ik heb geleerd waarvoor ik grid kan gebruiken en hoe ik grid beter kan indelen. 2 dingen interessant? Ik heb voorheen alleen met grid-template-columns grid-template-rows gewerkt. Daarna heb ik alles individuëel ingedeeld. Maar nu weet ik dat ik met grid-template-areas, hetzelfde makkelijker kan doen."
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik ging heel vaak div gebruiken in mijn code, Maar ik heb nu door dat dat bijna niet nodig is. i.p.v een div te gebruiken geef ik nu een class aan het element waar ik mee werk."
                        },
                        {
                            "type": "paragraph",
                            "header": "wat wil ik nog doen?",
                            "text": "een pagina maken waar ik al mijn foto's kan laten zien. en dan kan ik vanuit mijn journal naar de foto's linken, waar dat nodig is."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "11/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "wat heb ik geleerd?",
                            "text": "Responsive maken voor telefoon en tablets met mediaqueries"
                        },
                        {
                            "type": "paragraph",
                            "header": "dingen die ik interessant vond?",
                            "text": "Je kan media query nesten i.p.v helemaal onderaan in je code. Zo kan je code overzichtelijk blijven."
                        },
                        {
                            "type": "paragraph",
                            "header": "Waaraan heb je gewerkt vandaag?",
                            "text": "Vandaag hebt ik aan een layout voor een foto collage gewerkt met grid. De indeling is af. Ik heb met mijn team foto's gemaakt rond Hva amstel campus. De foto's zijn in de meeste gevallen te klein voor de grid vakjes die ik nu heb. De grid moet ik nu aanpassen naar de formaat van de foto's."
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb ook gewerkt aan een side scroller. Ik heb geprobeerd het zonder JavaScript te maken, dat was wel gelukt. Maar ik kreeg het niet op de juiste plek. Uiteindelijk heb ik wel JavaScript gebruikt, maar mijn JavaScript is wel heel simpel gebleven."
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target='_blank' href='https://divaninl.github.io/squad-page/Viresh/index_v.html'>Side scroller</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "12/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Waaraan heb ik gedaan vandaag?",
                            "text": "Ik heb vandaag gewerkt aan een campus pagina voor de squad page. hierin willen we locatien van amstelcampus met openingstijden en locaties van de HvA gebouwen en toevoegen."
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik moet meer met class gaan werken, vooral als je samen gaat werken met anderen. Ik probeerde vandaag mijn code toe te voegen met die van Dylan. Maar omdat ik met header, article, ul, en li ging werken, ontstonden er problemen met onze css. Ik moet nu mijn html en css aanpassen zodat ik het later makkelijker kan samenvoegen met de code van mijn teammates."
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target='_blank' href='https://github.com/vsheo/your-tribe-profile-card/blob/main/squad_page_bewijslast/campus_page_v1.png'>campus pagina</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "ideeen voor mijn eigen i love web: <a target='_blank' href='https://vasilis.nl/'>vasilis.nl</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "13/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Vandaag heb ik gewerkt aan de opmaak van mijn squad page. Ik had met de html checker 2 problemen gevonden in mijn code, die heb ik ook gelijk opgelost."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat wil ik nog doen?",
                            "text": "Ik wil mijn css voor I love web aanpassen, zodat alles aangepast wordt met class naam i.p.v de tag naam. Ik wil ook aan mijn afbeeldingen page beginnen."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "14/9/24 en 15/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Ik heb vandaag mijn html class names gegeven. Nu zal ik geen problemen meer hebben als ik bijvoorbeeld een nieuwe grid of tabel een andere stijl wil geven."
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb een web pagina gemaakt waar ik mijn foto's kan laten zien. Deze pagina is af, ik moet alleen nog foto's toevoegen."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "16/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Ik heb met figma gewerkt. Nu heb ik mijn squad page nagemaakt. wat ik nog moet doen is, nieuwe versies met verschillende kleuren en lettertypes maken. Ik heb geleerd hoe ik met figma kan werken. Nu weet ik dat figma heel handig is om verschillende concepten te maken, en ze met elkaar vergelijken."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "17/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "We zijn bezig geweest met mergen voor de squad page. Vandaag heb ik aan de campus pagina gewerkt. De informatie die op de pagina komt heb ik al toegevoegd. Ik ben nog niet helemaal tevreden met de stijl van mijn grid, daar zal ik morgen verder aan werken. De kleuren moeten ook nog aangepast worden, maar daarvoor moet ik nog overleggen met Dylan en Colin."
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target='_blank' href='https://github.com/vsheo/your-tribe-profile-card/blob/main/squad_page_bewijslast/campus_page_v2.1.png'>Campus pagina v1</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Vandaag hadden we ook een CSS college. Daarna hadden we 2 oefeningen met css transities en transformaties. De eerste heb ik af, met de tweede moet ik nog beginnen."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "18/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Vandaag heb ik de campus pagina voor onze squad page afgemaakt. Er was een klein probleem in mijn grid, waardoor een stuk tekst niet te zien was. Dat is nu opgelost. Ik had ook een probleem met de foto's, ze waren niet allemaal even groot. Dat heb ik kunnen oplossen met min-width, min-height en object-fit: cover. Ik heb ook aan de tabellen op de detailpagina gewerkt, die zijn ook af. Als laatst had ik vandaag de campus pagina ook responsive gemaakt."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat wil ik nog doen?",
                            "text": "Er zijn een paar foto's op de detailpagina die in de breedte zijn gemaakt. Op die plekken hebben we portretfoto's nodig. Morgen zal ik een paar nieuwe foto's maken."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "19/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Vandaag heb ik het laatste probleem met visitekaartje opgelost. De terugflip werkte niet, omdat backface-visibility op hidden stond, waardoor ik niet opnieuw kon klikken om de kaart terug te draaien. Nu heb ik in JavaScript een timer van 4 seconden ingesteld. Na die 4 seconden draait mijn visitekaartje automatisch terug. De transities heb ik ook wat vloeiender gemaakt op mijn visitekaartje. Als laatste heb ik mijn I love web aangevuld met foto's en daily check-outs."
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target='blank' href='https://vsheo.github.io/your-tribe-profile-card/'>Visitekaart final</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "20/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Vandaag heb ik de foto's op mijn Picture Vault-pagina beter geordend. Ik heb ook alle foto's en screenshots die ik nog miste toegevoegd. Daarnaast heb ik links vanuit mijn journal naar de Picture Vault toegevoegd. Ik ben nog niet helemaal tevreden met de indeling van de Picture Vault-pagina. Ik ben van plan om een paar foto's te verwijderen en de rest per sprint in te delen, zodat de pagina sneller laadt."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 1",
                    "title": "Your Tribe",
                    "date": "21/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Ik heb vandaag nieuwe fotopagina's gemaakt. In plaats van één pagina met alle foto's, heb ik nu één pagina per opdracht (visitekaart, I love web, squad page). Ik heb ook meteen de links van mijn journalpagina naar de foto's gemaakt. Hiervoor heb ik 'id' tags gebruikt."
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-2",
            "semesterClass": "semester-1-midterm",
            "articles": [
                {
                    "sprint": "Sprint 2",
                    "title": "The Client",
                    "date": "23/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Ik heb Mediahuis gekozen als mijn project. Mediahuis is een bedrijf met meerdere radiozenders. Het frontend bedrijf Triple heeft de opdracht aangenomen en bevindt zich inmiddels in de laatste fase van het project. Triple is mijn opdrachtgever, en zij willen dat ik hun website nabouw. Vervolgens moet ik er iets creatiefs aan toevoegen of aanpassen. Dit kan een nieuwe interactie, een andere stijl, of een aangepaste layout zijn."
                        },
                        {
                            "type": "paragraph",
                            "header": "3 dingen die ik heb gedaan?",
                            "text": "Ik heb een project uitgekozen. Ik heb geleerd hoe ik me moet voorbereiden op een briefing. Ik weet nu wat een debriefing is en hoe ik die moet aanpakken."
                        },
                        {
                            "type": "paragraph",
                            "header": "2 leervragen voor deze week",
                            "text": "Hoe kan ik deze week de website van Veronica, een zender van Mediahuis, op een semantisch correcte manier namaken?"
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target=\"blank\" href=\"https://github.com/fdnd-agency/triple/tree/design-challenge\">Triple repository</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 2",
                    "title": "The Client",
                    "date": "25/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik vandaag gedaan?",
                            "text": "Vandaag heb ik prototypes gemaakt. Dit is onderverdeeld in sitemaps, wireframes en wireflows. Daarna heb ik High Fidelity (HiFi) prototypes gemaakt, die kunnen worden gemaakt met programma's als Figma."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat moet ik doen voor aanstaande vrijdag?",
                            "text": "Voor aanstaande vrijdag moet ik semantisch correcte HTML-code schrijven voor de website die ik wil gaan bouwen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat wil ik zelf nog doen?",
                            "text": "Wat ik zelf nog wil doen, is mijn HiFi-prototype in Figma afmaken en breakdown-schetsen maken in mijn wireframes."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 2",
                    "title": "The Client",
                    "date": "27/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Stel drie vragen over wat je hebt geleerd over HTML:",
                            "text": "Waarom wil je geen div in je HTML? Waarvoor zou je wel een div kunnen gebruiken?"
                        },
                        {
                            "type": "paragraph",
                            "header": "Vandaag heb ik met Dylan code reviews geschreven voor:",
                            "text": "<a target=\"blank\" href=\"https://github.com/ambersr/the-client-website/issues/1#issuecomment-2378742366\">Code review Amber</a> <a target=\"blank\" href=\"https://github.com/FatimaZelay/the-client-website/issues/1#issuecomment-2378809084\">Code review Fatima</a> <a target=\"blank\" href=\"https://github.com/Clarice-COD/the-client-website/issues/1#issuecomment-2378762043\">Code review Clarice</a> <a target=\"blank\" href=\"https://github.com/cedrikstephen/the-client-website/issues/2#issue-2552394554\">Code review Cederik</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik geleerd over HTML:",
                            "text": "Wat ik heb geleerd over HTML is dat een section en article verplicht een h element nodig hebben. Ik heb niet overal bepaalde elementen nodig, meestal is het parent-element al genoeg. In mijn geval heb ik dan geen section nodig om mijn article in te delen, omdat ze al in de main staan."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 2",
                    "title": "The Client",
                    "date": "30/9/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag gedaan?",
                            "text": "Vandaag heb ik geleerd wat de verschillen zijn tussen flow, grid, flexbox, positioned, float, multi-column en table layout."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag geleerd?",
                            "text": "Vandaag heb ik geleerd dat HTML-elementen standaard een layout hebben, die je met CSS kunt veranderen. Ik heb geoefend met layouts zoals grid, float en flow."
                        },
                        {
                            "type": "paragraph",
                            "header": "De layouts die ik zal gebruiken voor de client website zijn",
                            "text": "Grid, flex en position. Ik gebruik grid voor de grote indeling van mijn website, flex om de elementen in de grid areas te plaatsen, en position voor kleine aanpassingen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a href=\"https://github.com/vsheo/layout-in-css/issues?q=is%3Aissue+is%3Aclosed\">link naar de layout deeltaak</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 2",
                    "title": "The Client",
                    "date": "07/10/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Drie Codeconventies van Vandaag:",
                            "text": "Indenten van HTML-code zorgt voor een duidelijke hiërarchie en verbetert de leesbaarheid.<br>Het nesten van CSS-selectors zorgt voor beter leesbaarheid, en je kan direct zien wat de parent en child elementen zijn.<br>CSS op dezelfde volgorde als HTML structuur voor eenvoudiger onderhoud.<br>Nesten van media queries dit laat zien hoe de stijl verandert bij verschillende schermformaten."
                        },
                        {
                            "type": "paragraph",
                            "header": "Twee Punten om de Leesbaarheid van HTML en CSS te Verbeteren:",
                            "text": "Witruimtes tussen HTML-elementen zorgt voor ademruimte en overzichtelijkheid.<br>Class names gebruiken om verschillen tussen dezelfde elementen te zien."
                        },
                        {
                            "type": "paragraph",
                            "header": "Conventies om te Implementeren in Mijn Eigen Code:",
                            "text": "Ik zal CSS-selectors nesten voor betere leesbaarheid en duidelijkheid.<br>Ook blijf ik zorgen dat mijn HTML en CSS in dezelfde volgorde zijn voor betere organisatie."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 2",
                    "title": "The Client",
                    "date": "09/10/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Doel van de Sprint Review",
                            "text": "Het doel van een sprint review is om de opdrachtgever te laten zien wat je deze sprint gedaan hebt en om feedback te krijgen. Ook informeer je de opdrachtgever over wat je in de komende sprint zal doen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Drie leervragen over de Les van Vandaag:",
                            "text": "Hoe verwerk je feedback van een sprint review?<br>Wat laat je zien tijdens een sprint review?<br>Hoe schrijf je een ReadMe?"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat Doe je na een Sprint Review",
                            "text": "Na een sprint review verwerk je de feedback door nieuwe issues aan te maken."
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-3",
            "semesterClass": "semester-1-midterm",
            "articles": [
                {
                    "sprint": "Sprint 3",
                    "title": "All human",
                    "date": "14/10/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag gedaan en geleerd?",
                            "text": "Vandaag heb ik geleerd dat er regels zijn voor websites die ervoor zorgen dat accessibility-tools goed kunnen functioneren. Ik heb ook geleerd wat een Lighthouse-test is en hoe ik deze kan uitvoeren.<br>De Lighthouse-test kan niet alles testen, daarom zijn handmatige testen ook nodig. Ik heb de A11y-test gebruikt om te controleren of mijn website toegankelijk is."
                        },
                        {
                            "type": "paragraph",
                            "header": "Schrijf op wat je nog moet doen voor WCAG van woensdag",
                            "text": "Voor de WCAG van woensdag moet ik nog de handmatige testen uitvoeren en mijn bevindingen opschrijven."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 3",
                    "title": "All human",
                    "date": "16/10/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag gedaan en geleerd?",
                            "text": "Vandaag heb ik een WCAG-audit gepresenteerd voor de Koffiesalon, het café waar ik werk. Daarnaast heb ik een user experience-workshop gedaan en gewerkt aan mijn \"I Love Web\"-project, waarin ik een nieuwe HTML-structuur heb opgezet voor betere toegankelijkheid."
                        },
                        {
                            "type": "paragraph",
                            "header": "Drie dingen die ik heb geleerd:",
                            "text": "hoe een website toegankelijker gemaakt kan worden door goede HTML met juiste labels, alt-attributen en een heldere heading-structuur.<br>Screen readers moeilijk kunnen navigeren zonder ARIA-attributen.<br>En hoe ik Polypane kan gebruiken voor het testen van toegankelijkheid."
                        },
                        {
                            "type": "paragraph",
                            "header": "Beschrijf alle 6 onderwerpen uit de workshop en noteer welke je toe kan passen in je opdracht",
                            "text": "<h4>Links:</h4>een anchor tag kan je gebruiken om veel te doen: verwijzen naar een andere site, een id op dezelfde pagina, of om iets te laten downloaden. een anchor tag biedt meer functies aan dan een button <br><h4>Afbeeldingen:</h4>img heeft een passende alt attribute nodig, omdat het dan een stuk tekst laat zien als het niet ingeladen wordt. En zodat een screen reader kan aangeven wat voor soort foto daar staat.<br><h4>Labels voor invoervelden:</h4>als er een label om een input veld is, dan kan de gebruiker makkelijk op de input veld klikken. de gebruiker kan op de tekst van de input veld klikken en beland in de input veld, of tikt de checkbox aan. als er geen label was dan zou de gebruiker precies moeten klikken op het kleine input veld.<br><h4>Informatie en accordeons:</h4>accordeons kunnen informatie bevatten die alleen te zien is als er op iets geklikt word. bijvoorbeeld 'meer info' als hierop geklikt wordt komt er een stuk tekst eronder met uitleg. <br><h4>Pop-ups:</h4>een pop up is iets dat op de website tevoor schijn komt. dit kan gebruikt worden voor inloggen, een formulier invullen of als advertenties.<br><h4>Headings:</h4>heading worden gebruikt om de pagina een structuur te geven, net als een inleiding van een boek. h1 is je tietel h2 een onderdeel van de h1 h3 gaat dieper op h2 in h2 een ander onderdeel van h1<br>Ik kan links, afbeeldingen en headings toepassen in de website van de opdrachtgever"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 3",
                    "title": "All human",
                    "date": "18/10/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag gedaan en geleerd?",
                            "text": "Ik heb samen met Amber code reviews geschreven voor de projecten van Robin, Colin, Fatima en Iris. Hier zijn de links naar de reviews: <br><a href=\"https://github.com/Robinwouterson/all-human-accessible-website/issues/5\">Robin</a> <a href=\"https://github.com/ColindeGroot/all-human-accessible-website/issues/1\">Colin</a> <a href=\"https://github.com/fatimahilali/all-human-accessible-website/issues/3\">Fatima</a> <a href=\"https://github.com/irisvw/all-human-accessible-website/issues/8\">Iris</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Daarnaast heb ik feedback gevraagd op mijn design bij de twee mentoren.",
                            "text": "Mijn designs waren duidelijk en er waren weinig verbeterpunten nodig."
                        },
                        {
                            "type": "paragraph",
                            "header": "Neem de uitbreiding van de checklist code-review toegankelijkheid over in je learning log en leg kort uit hoe je deze getest hebt.",
                            "text": "Het contrast tussen achtergrond en tekst: ik had witte tekst op een lichtblauwe achtergrond, wat er voor mij duidelijk uitzag. Met een contrast checker heb ik gezien dat het contrast te laag is."
                        },
                        {
                            "type": "paragraph",
                            "header": "Sommige HTML elementen hebben verplicht een bepaalde child element nodig, zoals:",
                            "text": "Section en article moeten een h element bevatten, ul en ol hebben li elementen nodig."
                        },
                        {
                            "type": "paragraph",
                            "header": "Kijken of de focus duidelijk is.",
                            "text": "Door de tabben door mijn website heb ik gekeken of het duidelijk is waarop de tab nu gefocust is."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 3",
                    "title": "All human",
                    "date": "21/10/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag geleerd?",
                            "text": "Niet iedereen ziet hetzelfde, als frontender moet je rekening houden daarmee."
                        },
                        {
                            "type": "paragraph",
                            "header": "Ik heb vandaag uitgevonden wat keyframes zijn in CSS.",
                            "text": "Ik zocht naar een manier om animaties uit te voeren op mijn articles. Met keyframes kan ik de article eerst uit beeld plaatsen, en daarna in beeld brengen met een transform.<br><a href=\"https://github.com/vsheo/i-love-web/blob/6deef9743c437ce0e61074ca276ca741c7760a2f/styles/new_journal.css#L84C1-L94C2\">Keyframes in mijn code</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 3",
                    "title": "All human",
                    "date": "23/10/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "3 dingen die je vandaag hebt gedaan",
                            "text": "Ik heb mijn laptop zonder muis of trackpad gebruikt en keyboard shortcuts opgezocht. Daarnaast heb ik een sprint review voorbereid voor morgen met de opdrachtgever.<br>Ik heb uitgezocht wat de JavaScript Intersection Observer is en hoe deze werkt, voor mijn I Love Web.<br><a href=\"https://github.com/vsheo/i-love-web/blob/6deef9743c437ce0e61074ca276ca741c7760a2f/scripts/inter_ob.js#L3C1-L24C3\">Intersection observer in mijn code</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Beschrijf 2 verbeteringen die je in je readme hebt gemaakt",
                            "text": "Ik heb een QR-code toegevoegd, zodat de website makkelijker op een telefoon bekeken kan worden. Ik heb ook uitgelegd hoe de website werkt, zodat gebruikers beter begrijpen wat het al kan doen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Schrijf 1 ding die je anders gaat aanpakken tijdens de komende sprint",
                            "text": "Op 1 issue concentreren, niks ernaast doen. Ik heb vaker gehad waar ik een nieuw probleem tegen kwam terwijl ik al bezig was met een issue. Dan probeer ik het nieuw probleem eerst op te lossen, daarna ga ik verder met de vorige issue. Als ik daarna een commit push, en de issue eraan link, is er veel veranderd dat niet met die issue te maken had. Ik zal komende sprint nieuwe issues maken i.p.v het gelijk op te lossen."
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-4",
            "semesterClass": "semester-1-endterm",
            "articles": [
                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "11/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Documenteer wat je vandaag hebt gedaan",
                            "text": "Vandaag hebben we de styleguide deeltaak gehad. Hiervoor moeten we eerst een style guide maken met de team die dezelfde opdrachtgever heeft. Daarmee kunnen we een style guide maken, waarmee we deze sprint verder zullen werken.<br>De style guide en style sheet die ik met Julia en Robin heb gemaakt<br><a href=\"https://www.figma.com/design/INZhyl3rxr3skj2rwCjVFU/Mediahuis-Design-Guide?node-id=2296-4071&t=UO2k9PkzSEk9yCDY-1\">Style guide</a><br><a href=\"https://vsheo.github.io/look-and-feel-styleguide/\">Style sheet</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "3 dingen die je hebt geleerd",
                            "text": "Elk bedrijf heeft een huisstijl.<br>Styles guide maken.<br>Ik heb vandaag geleerd dat elk bedrijf een eigen huisstijl heeft. Als frontender moeten wij rekening houden hiermee. Voor elk project wordt er eerst een stijle sheet gemaakt m.b.v een style guide. Dit wordt gedaan om ervoor te zorgen dat iedereen binnen het team dezelfde stijl gebruikt."
                        },
                        {
                            "type": "paragraph",
                            "header": "Hoe pak je met je team deze opdracht aan?",
                            "text": "We hebben na de les besloten om er direct aan te werken. In een Figma-bestand hebben we een interface inventory gemaakt. Hier hebben we gezien dat iedereen een andere stijl had voor dezelfde elementen.<br>Daarna hebben we een style guide gemaakt. Hiervoor hebben we de huisstijl van Radio Veronica overgenomen. We hadden door dat het overzetten van de style guide naar een style sheet snel gedaan kon zijn, dus we hebben dat ook direct gedaan.<br>Thuis zal ik de classnames in het HTML zetten, met ook wat beschrijving.<br>We moeten nog een beslissing maken of we een andere typografie zullen gebruiken voor de mobiele versie van de desktop. Nu hebben we alleen een style sheet voor de desktopversie. We zullen eerst werken met de style sheet die we nu hebben, als het niet goed eruit ziet, zullen we bespreken hoe we een mobiele versie gaan maken."
                        },
                        {
                            "type": "paragraph",
                            "header": "Waar gaan we afspraken bijhouden?",
                            "text": "We hebben besloten om onze afspraken in de ReadMe van look-and-feel-styleguide bij te houden. De reden waarom ik heb voorgesteld om het in de ReadMe bij te houden is; de ReadMe is makkelijker om de afspraken op te zoeken, omdat we vaker in de repository bezig zijn.<br><a href=\"https://github.com/vsheo/look-and-feel-styleguide#:~:text=de%20juiste%20toepassing.-,Afspraken,-Er%20gelden%20een\">Afspraken</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "12/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag gedaan?",
                            "text": "Vandaag heb ik breakdown schetsen gemaakt voor een nieuwe mobiele en desktop website. In deze nieuwe designs heb ik rekening gehouden met wat de opdrachtgever als feedback had gegeven tijdens de laatste sprint:<br><ul><li>Mobiel:<ul><li>Alle radiozenders in 1 oogopzicht</li></ul></li><li>Desktop:<ul><li>1 lijst voor de tijdlijn</li><li>1 lijst voor de weekdagen</li></ul></li></ul>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag geleerd?",
                            "text": "Ik heb vandaag ook een Figma-workshop gehad. Hier hebben we een bestaande template aangepast. Dit heb ik na de workshop ook gedaan voor mijn website. Ik heb de Figma van Triple genomen, elementen verplaatst, toegevoegd en veranderd. Ik had door dat in dit Figma gewerkt werd met frames en daarin nog meer frames, ik kon die elementen niet aanpassen (text en kleur). Ik heb voor nu de elementen binnen de frames gekopieerd en geplakt op een figuur, en het daarna tot een group gemaakt."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat ga je morgen doen?",
                            "text": "Morgen ga ik beginnen met het bouwen van mijn HTML."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "13/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik vandaag gedaan?",
                            "text": "Robin is gestopt met de opleiding, dus Julia en ik gaan verder werken aan onze gezamenlijke stylesheet. We hebben nieuwe namen bedacht voor sommige classes. We hebben nu alle kleuren als variabelen opgeslagen in een class en we hebben aparte classes voor het veranderen van color, background-color, font-size, enz. Dus we hebben altijd twee classes nodig om iets te veranderen.<br><a href=\"https://github.com/vsheo/look-and-feel-styleguide\">GitHub gezamenlijke stylesheet</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Voorbeeld",
                            "text": "Om de achtergrondkleur aan te passen, heb je eerst de class brand-primary nodig. Deze kan de background-color veranderen, maar zelf heeft deze geen kleur. Je hebt dan ook de background-color-veronica nodig, deze class heeft alleen de kleur. Als deze twee classes op één element staan, verandert de achtergrondkleur.<br><br>Als we de kleur willen veranderen, hoeft dit alleen in background-color-veronica gedaan te worden.<br><a target=\"_blank\" href=\"./assets/mediahuis/sprint_4/2classes_vb_journal.png\">voorbeeld</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik geleerd?",
                            "text": "- Ik heb geleerd hoe ik gebruik kan maken van twee classes om één element aan te passen. Het is lastig om te begrijpen, maar als ik later iets wil aanpassen, is het een stuk makkelijker.<br><br>- Ik heb ook geleerd dat er een soort rank is tussen style attributes, ID's, classes en elementnamen. Als er een kleur is op een element en hetzelfde element krijgt met ID een andere kleur, dan wordt de kleur van de ID toegepast."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "15/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik vandaag gedaan?",
                            "text": "Vandaag heb ik samen met Julia en Aria code reviews gedaan op de styleguide en stylesheet van Bieb in Bloei en Drop & Heal. Dit hebben we gedaan voor Squad G en Squad H, dus 4 reviews in totaal."
                        },
                        {
                            "type": "paragraph",
                            "header": "Styleguide repositories",
                            "text": "<a href=\"https://github.com/kimnikitaschijf/look-and-feel-styleguide\">Bieb in Bloei Squad 1G</a><a href=\"https://github.com/Sidopjescherm/look-and-feel-styleguide\">Bieb in Bloei Squad 1H</a><a href=\"https://github.com/Matthijs217/look-and-feel-styleguide\">Drop and Heal Squad 1G</a><a href=\"https://github.com/RickFDND/look-and-feel-styleguide\">Drop and Heal Squad 1H</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Issues",
                            "text": "<a href=\"https://vsheo.github.io/i-love-web/html/p_mediahuis.html#:~:text=Sprint%204%20code%20review%20styleguide%20en%20stylesheet\">Code review issues als foto's</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "18/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik vandaag gedaan?",
                            "text": "Vandaag heb ik een custom font gemaakt."
                        },
                        {
                            "type": "paragraph",
                            "header": "Font-family en Fallback",
                            "text": "Ik heb geleerd dat er meerdere fonts op een website kunnen zijn. Met font-family krijg je een fallback, wat betekent dat als je laptop of browser de eerste font niet kan lezen, dan wordt de tweede font in de font-family gebruikt. Voorbeeld: font-family: \"Times New Roman\", Times, serif;"
                        },
                        {
                            "type": "paragraph",
                            "header": "Absolute en Relative units in CSS",
                            "text": "Ik heb geleerd dat er in CSS absolute en relative units zijn. Van de absolute units gebruiken we alleen px voor het web. Relative units zijn afhankelijk van een ander element."
                        },
                        {
                            "type": "paragraph",
                            "header": "Absolute length units",
                            "text": "<span>centimeters(cm): In CSS, 1cm is roughly 37.8 pixels, or about 25.2/64 of an inch.</span><br><span>millimeters(mm): In CSS, 1mm is roughly 3.78 pixels, or 1/10th of a centimeter.</span><br><span>inches(in): In CSS, 1in is roughly 96 pixels, or about 2.54cm.</span><br><span>points(pt): In CSS, 1pt is roughly 1.3333 pixels, or 1/72th of an inch.</span><br><span>picas(pc): In CSS, 1pc is roughly 16 pixels, or 1/6 of an inch.</span><br><span>pixels(px): <a href=\"https://www.freecodecamp.org/news/css-unit-guide/#:~:text=units%20in%20CSS%3A-,px,-Pixels%2C%20or%20px\">meer over px</a></span>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Relative length units",
                            "text": "<span>em: Relative to the font-size of the element (2em means 2 times the size of the current font) <a href=\"https://www.freecodecamp.org/news/css-unit-guide/#:~:text=relative%20length%20units%3A-,em,-The%20CSS%20em\">meer info</a></span><br><span>ex: Relative to the x-height of the current font (rarely used)</span><br><span>ch: Relative to the width of the \"0\" (zero) <a href=\"https://www.freecodecamp.org/news/css-unit-guide/#:~:text=is%20rarely%20used.-,ch,-Character%20unit.%20The\">meer info</a></span><br><span>rem: Relative to font-size of the root element <a href=\"https://www.freecodecamp.org/news/css-unit-guide/#:~:text=the%20targeted%20element.-,rem,-Root%20em.%20This\">meer info</a></span><br><span>vw: Relative to 1% of the width of the viewport</span><br><span>vh: Relative to 1% of the height of the viewport</span><br><span>vmin: Relative to 1% of viewport's* smaller dimension</span><br><span>vmax: Relative to 1% of viewport's* larger dimension</span><br><span>%: The % unit sets the font-size relative to the current font-size</span>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Meer info over CSS units",
                            "text": "<a href=\"https://developer.mozilla.org/en-US/docs/Learn/CSS/Building_blocks/Values_and_units#:~:text=things%20will%20become.-,Absolute%20length%20units,-The%20following%20are\">meer info over css units:</a><br><a href=\"https://www.w3schools.com/cssref/css_units.php\">meer info over css units</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "21/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan?",
                            "text": "- De layout voor de mobiele website afgemaakt<br>- JavaScript om alle details op display none te zetten als 1 open gaat<br>- JavaScript om de tijd, weekdagen player en de nav op beeld te brengen als 1 detail open gaat<br>- JavaScript om met een button een nav op beeld te laten sliden."
                        },
                        {
                            "type": "paragraph",
                            "header": "Start desktop layout",
                            "text": "Ik heb een start gemaakt aan de desktop layout."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat wil ik morgen doen?",
                            "text": "Verder gaan met de desktop layout, en proberen dat af te maken."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "22/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan?",
                            "text": "Scroll snap van Sanne toegepast met JavaScript voor de section scroll snap. Als er op een radiozender geklikt wordt, gaat het open en naar het midden."
                        },
                        {
                            "type": "paragraph",
                            "header": "Desktop layout",
                            "text": "De desktop layout is af. Voor de desktop versie moet ik alleen nog de gezamenlijke stylesheet gebruiken voor de opmaak van de elementen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat wil ik nog doen?",
                            "text": "De scroll snap nog beter maken. De scroll snap gaat nu naar het midden. Ik wil dat het vlak onder de tijdlijn terechtkomt."
                        },
                        {
                            "type": "paragraph",
                            "header": "Programma kaartjes",
                            "text": "De tekst in de programma kaartjes wil ik invullen zodat het overeenkomt met wat er nu is op de website van de radiozender."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "26/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Gestalt Principles",
                            "text": "De les van vandaag ging over gestalt Principles. Hier is een korte samenvatting daarover."
                        },
                        {
                            "type": "paragraph",
                            "header": "Law of Common Region",
                            "text": "Een border om een element of een groep van elementen is een manier om common region te maken."
                        },
                        {
                            "type": "list",
                            "items": [
                                "border",
                                "border-radius",
                                "background-color",
                                "padding",
                                "box-shadow"
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": "Common region helpt gebruikers om snel te zien wat bij elkaar hoort, en om de relatie te zien tussen elementen en sections. Een border om een groep van elementen laat zien dat ze bij elkaar horen, en het laat ook zien waar iets nieuws gaat beginnen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Bijvoorbeeld",
                            "text": "In mijn I love Web heb ik een background-color die langzaam over gaat naar een andere background-color. Dit heb ik gedaan om te laten zien dat we over gaan naar daily checkout van de volgende sprint."
                        },
                        {
                            "type": "paragraph",
                            "text": "Meer uitleg: <a target=\"_blank\" href=\"https://www.nngroup.com/articles/common-region/\">Klik hier</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Law of Proximity",
                            "text": "Elementen die dichtbij elkaar staan worden door gebruikers waargenomen als een groep. In webdevelopment kan je dit doen door margins en padding toe te voegen zodat er meer of minder wit ruimte is tussen elementen. Dit helpt gebruikers om te zien wat bij elkaar hoort."
                        },
                        {
                            "type": "paragraph",
                            "header": "Voorbeeld",
                            "text": "Een form met 12 input velden onder elkaar lijkt op veel werk om in te vullen, maar als we ze verdelen in 3 sections van 4 input velden dan lijkt het makkelijker."
                        },
                        {
                            "type": "paragraph",
                            "text": "Als proximity te groot is tussen elementen, dan kan het zijn dat bepaalde elementen, die belangrijk zijn, niet gezien worden omdat de whitespace te groot is."
                        },
                        {
                            "type": "paragraph",
                            "text": "Meer over Law of Proximity: <a target=\"_blank\" href=\"https://www.nngroup.com/articles/gestalt-proximity/\">Klik hier</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Meer uitleg: <a target=\"_blank\" href=\"https://www.chrbutler.com/gestalt-principles-of-design-proximity/\">Klik hier</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Law of Similarity",
                            "text": "Elementen die op elkaar lijken worden gezien als elementen die iets met elkaar te maken hebben. Elementen die anders eruit lijken worden gezien als of het om een ander onderwerp gaat."
                        },
                        {
                            "type": "list",
                            "items": ["kleur", "typografie", "vorm en stijl"]
                        },
                        {
                            "type": "paragraph",
                            "header": "Voorbeeld",
                            "text": "h1, h2 en alineas geeft structuur aan je website. Het laat zien een paar alineas bij 1 titel/subtitel behoort. Dit zorgt voor overzichtelijkheid en helpt de gebruiker om de informatie snel te verwerken."
                        },
                        {
                            "type": "paragraph",
                            "text": "Meer over Law of Similarity: <a target=\"_blank\" href=\"https://www.nngroup.com/articles/gestalt-similarity/\">Klik hier</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Meer uitleg: <a target=\"_blank\" href=\"https://www.chrbutler.com/gestalt-principles-of-design-similarity/\">Klik hier</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 4",
                    "title": "Look and Feel",
                    "date": "28/11/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik vandaag gedaan?",
                            "text": "Ik heb een readme gemaakt. Hier in heb ik uitgelegd hoe de website nu werkt. <a target=\"_blank\" href=\"https://github.com/vsheo/look-and-feel-corporate-identity/blob/main/README.md\">ReadMe</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb ook een website gemaakt voor het uitleggen van onze gezamenlijke stylesheet. Het heeft niet veel tekst omdat het bedoelt is om tijdens een presentatie uit te leggen. <a target=\"_blank\" href=\"https://vsheo.github.io/look-and-feel-corporate-identity/stylesheet_uitleg/uitleg.html\">stylesheet uitleg</a>"
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-5",
            "semesterClass": "semester-1-endterm",
            "articles": [
                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "02/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Sprint planning gemaakt. Begonnen met een road map in mijn project board. Ik heb de planning van sprint 5 overgenomen in mijn road map. Dit lijkt op een drukke sprint, dus ik heb ook gelijk toegevoegd dat ik tussen maandag en dinsdag schetsen, html first, en mobile first gedaan wilt hebben."
                        },
                        {
                            "type": "paragraph",
                            "header": "User story",
                            "text": "Ik heb een user story en wireflow gemaakt, voor een javascript interactie die ik in deze sprint wil gaan maken. <a target=\"_blank\" href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/4\">user story issue</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Hoe ver ben je met de deeltaak JS fundamentals?",
                            "text": "Ik heb de eerste gedaan over variables. Dit stukje ken ik al, ik zal door de eerste paar oefeningen heen gaan totdat ik wat moeilijkere opdrachten tegen kom."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "04/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Vandaag hadden we deze JavaScript workshop:",
                            "text": "Vandaag hadden we deze JavaScript workshop: <a target=\"_blank\" href=\"https://github.com/fdnd-task/fix-the-flow-interactive-website/blob/main/docs/programming-user-interaction.md\">JS workshop</a> Ik heb de interactie die ik wil maken al, en de schetsen en breakdown schet ook. Ik wil eerst de HTML en mobile first maken voordat ik met JavaScript begin."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan?",
                            "text": "HTML first af <a target=\"_blank\" href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/2\">HTML first issue</a> mobile first af, zonder JS <a target=\"_blank\" href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/3\">mobile first issue</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat ga ik nu doen?",
                            "text": "Beginnen met JavaScript, dit zijn de issues waar ik bij hou wat ik met JavaScript aan het doen ben. <a target=\"_blank\" href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/4\">JS issue: mobile nav</a> <a target=\"_blank\" href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/5\">JS issue: remove hidden</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "05/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan?",
                            "text": "Ik heb mobile CSS afgemaakt en ook de classes van de gedeelde stylesheet in de HTML toegevoegd. <a target=\"_blank\" href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/3\">mobile CSS</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan?",
                            "text": "Ik heb JavaScript geschreven die de weekdagen, tijdlijn, radio nav en de player op beeld brengen. <a target=\"_blank\" href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/5\">JS issue: remove hidden</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan?",
                            "text": "Ik heb JavaScript geschreven voor het verwisselen van radiozender, maar er is nog een bug, waar soms de class 'hidden' niet weggehaald wordt. Als dit gebeurt dan is er geen programma te zien. <a target=\"_blank\" href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/4\">JS issue: mobile nav</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat ga ik nu doen?",
                            "text": "Voor nu ben ik klaar met de mobiele versie, ik ga nu concentreren op CSS en JavaScript voor de desktop versie."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "06/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Code & design review",
                            "text": "Vandaag hadden we een code & design review les: <a target=\"_blank\" href=\"https://github.com/fdnd-task/fix-the-flow-interactive-website/blob/main/docs/code-design-review-programming-user-interaction.md\">de les</a>. Ik heb samen met Amber, Kim en Lemuel, deze issues geschreven:"
                        },
                        {
                            "type": "paragraph",
                            "header": "",
                            "text": "<a target=\"_blank\" href=\"https://github.com/Ravirkt/fix-the-flow-interactive-website/issues/8\">Ravi: code review</a> <a target=\"_blank\" href=\"https://github.com/Ravirkt/fix-the-flow-interactive-website/issues/9\">Ravi: design review</a> <a target=\"_blank\" href=\"https://github.com/Matthijs217/fix-the-flow-interactive-website/issues/4\">Matthijs: code review</a> <a target=\"_blank\" href=\"https://github.com/Matthijs217/fix-the-flow-interactive-website/issues/3\">Matthijs: design review</a> <a target=\"_blank\" href=\"https://github.com/irisvw/fix-the-flow-interactive-website/issues/3\">Iris: code review</a> <a target=\"_blank\" href=\"https://github.com/irisvw/fix-the-flow-interactive-website/issues/4\">Iris: design review</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "09/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Hoeveel van de 10 experimenten heb je al gemaakt?",
                            "text": "Ik heb 5 van de 10 af, deze heb ik nu gebruikt: <br />- mouseover <br />- click <br />- dblclick <br />- mousemove <br />en nog een click die samen werkt met e.ctrlkey. <a target=\"_blank\" href=\"https://vsheo.github.io/ui-events/\">link naar de live site</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Bij welk gedragscriterium past deze deeltaak en wat moet je nog doen om het te kunnen toevoegen aan portflow?",
                            "text": "- Dit past bij methodisch handelen, omdat ik op basis van wat ik nu heb geleerd deze UI-events kan gebruiken op de volgende websites die ik ga maken. <br />- Dit past ook bij probleemoplossend vermogen, omdat ik tijdens het oefenen/uitzoeken van deze UI-events een creatieve manier heb gezocht om hiervan gebruik te maken."
                        },
                        {
                            "type": "paragraph",
                            "header": "Links:",
                            "text": "<a target=\"_blank\" href=\"https://github.com/fdnd-task/ui-events/blob/main/docs/INSTRUCTIONS.md\">UI events opdracht</a> <a target=\"_blank\" href=\"https://developer.mozilla.org/en-US/docs/Web/API/Element#events\">UI events</a> <a target=\"_blank\" href=\"https://developer.mozilla.org/en-US/docs/Web/API/KeyboardEvent\">keyboard events</a> <a target=\"_blank\" href=\"https://developer.mozilla.org/en-US/docs/Web/API/MouseEvent\">mouse events</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "10/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Ik heb een workshop over viewport transistion gevolgd. hier is een link naar waar ik heb geoefend met viewport transistion <a target=\"_blank\" href=\"https://vsheo.github.io/fix-the-flow-interactive-website/workshop_view-transition/page3.html\">viewport transistion</a> En ik heb de ui events deeltaak afgemaakt. <a target=\"_blank\" href=\"https://github.com/vsheo/ui-events\">deeltaak github</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "11/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag geleerd over HTML?",
                            "text": "HTML heeft het attribuut required, zodat de gebruiker verplicht is om de velden in te vullen. Je kunt HTML-elementen strategisch gebruiken om je JavaScript-code eenvoudiger te maken."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb je vandaag geleerd over CSS?",
                            "text": "Met CSS-selectoren kun je specifiek de eigenschappen van HTML-elementen aanpassen en bepalen hoe ze eruitzien of zich gedragen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat ga je voor vrijdag nog toevoegen?",
                            "text": "De functionaliteit van \"section snap\" verder verbeteren. \"Same-time scroll\" maken."
                        },
                        {
                            "type": "paragraph",
                            "header": "Welke functionaliteit wil je vrijdag laten testen?",
                            "text": "Section snap en Same-time scroll."
                        },
                        {
                            "type": "paragraph",
                            "text": "<a href=\"https://github.com/fdnd-task/fix-the-flow-interactive-website/blob/main/docs/form-states.md\" target=\"_blank\">Workshop van vandaag</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "16/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "3 studievragen over navigeren en label",
                            "text": "(studievragen zijn moeilijke proefwerkvragen die je na vandaag kan beantwoorden)"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat wil je laten zien bij de laatste sprint review?",
                            "text": "PS: 07-01-2025 vergeten vragen te bedenken"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "18/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Readme geanalyseerd, gekeken wat goed ging en wat beter kan. <a target=\"_blank\" href=\"https://github.com/Annevd/user-needs\">Anne</a> <a target=\"_blank\" href=\"https://github.com/ambersr/all-human-accessible-website\">Amber</a> <a target=\"_blank\" href=\"https://github.com/TygoWolven/Sprint5-Interactive-Website\">Tygo</a> <a href=\"/assets/mediahuis/sprint_5/readme_analyse.jpg\" target=\"_blank\">Whiteboard foto</a> Ik heb ook een ReadMe gemaakt en aan mijn issues gewerkt."
                        },
                        {
                            "type": "paragraph",
                            "header": "Links",
                            "text": "<a href=\"https://github.com/vsheo/fix-the-flow-interactive-website#fix-the-flow\" target=\"_blank\">ReadMe</a> <a href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/8\" target=\"_blank\">issue 8</a> <a href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/13\" target=\"_blank\">issue 13</a> <a href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/15\" target=\"_blank\">issue 15</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 5",
                    "title": "Fix the Flow",
                    "date": "19/12/24",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Ik heb vandaag de sprint review gehad, het ging best wel goed. Ik heb een issue gemaakt met de feedback van de opdrachtgever <a href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/18\" target=\"_blank\">Feedback opdrachtgever</a> Ik heb ook een Lighthouse-test en een screenreader-test uitgevoerd. Een aantal van de problemen die daarbij naar voren kwamen, heb ik direct geprobeerd op te lossen. <a href=\"https://github.com/vsheo/fix-the-flow-interactive-website/issues/16\" target=\"_blank\">Issue 16: testen</a>"
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-6",
            "semesterClass": "semester-1-endterm",
            "articles": [
                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "06/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "<a target=\"_parent\" href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/sprint-planning.md\">De les van vandaag</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Indicatroren waaraan ik extra aandacht wil besteden in deze sprint <br> 1.1.3 - testen: wcag keyboard, lighthouse, screen reader <br> 1.3.1 & 1.4.1 - samenwerken: briefing <br>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Eerst individuele briefing geschreven en daarna een samengevoegde versie gemaakt. We hadden afgesproken om de individuele debriefing voor 8 uur op te sturen, daarna een samengevoegde versie te maken <a target=\"_blank\" href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/blob/main/assets/brief-debrief/Debriefing%20final%20FRD.pdf\">samengevoegde briefing</a> Sprint planning gemaakt in een projectboard <a href=\"https://github.com/users/vsheo/projects/8/views/4\">project</a> hier staat wat ik vandaag heb gedaan <a target=\"_blank\" href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/2\">issue: sprint planning</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Checkout",
                            "text": "Wat zijn je voornemens voor dit jaar? Voor dit studiejaar wil ik 60 studiepunten behalen. FDND is een soort bedrijf, waar je van elkaar kan leren en elkaar kan helpen. De plek om de beste frontender te worden... Studenten gaan soms vroeg weg en op dinsdag en donderdag zijn er weinig mensen. Wat heb jij nodig om langer te blijven werken bij FDND? Ik heb de JS challenges van 07-01-25 gevolgd, ik vind dat het nog bij het begin is van JS, dit begrijp ik al. Ik zou graag wat moeilijkere challenges willen. <br> Voor de donderdag waar we vragen kunnen stellen, ik zoek liever zelf uit hoe iets werkt, daarom heb ik niet vaak vragen die ik zou willen stellen. <br> En ik werk nu elke maandag en woensdag tot 23:00 uur, daarom ben ik vaak niet aanwezig bij deze lessen."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "07/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "Ik heb vandaag de JS challenge les gevolgd. <a target=\"_blank\" href=\"https://github.com/vsheo/manipulate-dom-and-cssom\">JS repository</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb schetsen gemaakt, en ik ben gelijk begonnen met HTML first voor de overzicht en details pagina <a target=\"_blank\" href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/3\">schetsen</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "08/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "de les van vandaag <a target=\"_blank\" href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/mobile-first.md\">mobile first workshop</a> <a target=\"_blank\" href=\"https://www.w3.org/TR/mediaqueries-5/#mf-interaction\">features binnen mediaqueries</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "vandaag heb ik met het figma design van de opdrachtgever een interface inventory en styleguide gemaakt <a target=\"_blank\" href=\"https://www.figma.com/design/jk7gjHw03a0DnXfNAR2PMh/FDND-AccessDash-opdracht-januari-2025?node-id=0-1&t=XxqUdShybcfxe3nd-1\">figma design van de opdrachtgever</a> <a target=\"_blank\" href=\"https://www.figma.com/design/1kkuJrXMQLT35zcuAUyZ4U/styleguide-Future-Ready-Design?node-id=1-2&t=ztasI5EpLMXGMAJD-1\">interface inventory en styleguide</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "09/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "tip: als je in figma de icon selecteerd (vector) dan kan je het aan de rechterkant exporteren naar een svg"
                        },
                        {
                            "type": "paragraph",
                            "text": "vandaag ben ik begonnen met one colum layout <a target=\"_blank\" href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/mobile-first.md#:~:text=je%20het%20issue.-,One%20Column%20Layout,-Als%20de%20HTML\">uitleg over one colum layout</a> <a target=\"_blank\" href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/9\">issue waar ik hieraan heb gewerkt</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "10/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "vandaag hadden wij de workshop code & design review mobile first <a target=\"_blank\" href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/code-design-review-mobile-first.md\">dit was de opdracht</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "hier staan links naar de issues die geschreven zijn door Senne Nadia en ik. <a target=\"_blank\" href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/17\">issues geschreven zijn door Senne Nadia en ik</a> De issues die ik gekregen heb, heb ik gelijk verwerkt. 1 issue neemt wat meer tijd, nieuwe states maken, deze issue los ik een ander keer op."
                        },
                        {
                            "type": "paragraph",
                            "text": "<a href=\"https://www.youtube.com/watch?v=2IV08sP9m3U\">tips & tricks voor responsiveness</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "12/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "Hier staan een paar tips en tricks voor responsiveness <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=2IV08sP9m3U\">tips & tricks voor responsiveness</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "relative padding",
                            "text": "dit doe je met de min() functie in CSS <a target=\"_blank\" href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/min\">MDN: min()</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "responsive font-sizes",
                            "text": "eerste tip, gebruik rem voor tekst.<br>rem: relative to the root font-size. op default is dat 16px<br>vb:<br>font-size: 1.5rem;<br>16 x 1.5 = 24px <br><br> tweede tip gebruik vw voor grote letters zoals headings:<br>vb:<br>font-size: 10vw;<br>dit zorgt ervoor dat de heading altijd 10% van de viewport width is<br><br> let op: op hele grote schermen is 10vw te groot.<br>maak dan ook gebruik van clamp, om een min en max aan te geven zodat het nooit te klein of te grootr zal zijn<br>vb:<br>font-size: clamp(1.8rem, 10vw, 5rem);<br><br> als je op je scherm inzoom of uitzoom maakt met ctrl + \"-\" of \"+\". dan verander de groote van de tekst niet.<br> omdat vw alleen kijkt naar de viewport<br><br> dit kan opgelost worden met calc()<br>vb:<br>font-size: clamp(1.8rem, calc(7vw + 1rem), 5rem);<br>nu wordt bde heading ook groter en kleiner bij in en uit zoomen"
                        },
                        {
                            "type": "paragraph",
                            "header": "responsive images",
                            "text": "met max-width: 100%;<br> hiermee zorg je ervoor de de image nooit groter is dan de grootte van het scherm<br><br> de image wordt nu gestretched als het scherm te klein is.<br> met:<br>height: auto;<br> zorg je ervoor dat de image dan altijd \"normaal/goed\" eruit ziet<br><br> als je images hebt met verschillende sizes, kan je aspect-ratio gebruiken om ze allemaal tot dezelfde size te maken.<br>vb:<br>aspect-ratio: 16 / 9; voor smartphone in landscape mode<br>aspect-ratio: 9 / 16; voor smartphone in portrait mode<br><br> het kan zijn dat dit je image ook stretched<br> met:<br>object-fit: cover;<br> kan je dan ervoor zorgen dat dat niet gebeurt. het kan zijn dat er een deel van de image afgesneden wordt."
                        },
                        {
                            "type": "paragraph",
                            "header": "gebruik dvh i.p.v vh",
                            "text": "op smartphones heb je bovenaan een search bar die weg gaat als je scrolled.<br> dvh houdt rekeneing daarmee, vh niet"
                        },
                        {
                            "type": "paragraph",
                            "header": "mobile nav",
                            "text": "als je een nav op beeld wilt laten komen met een animatie dan kan je geen display none gebruiken.<br> wat je wel zou kunnen doen is met opacity werken.<br> vb een transition van opacity 0 naar opacity 1.<br> of met position absolute <br><br> deze 2 manieren zijn beide ontoegankelijk. Omdat je ze nogsteeds kan bereiken met tab ookal zijn ze van je scherm af.<br><br> je zou in HTML inert kunnen gebruiken. (inert prevents clicks and focus)<br> <a target=\"_blank\" href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Global_attributes/inert\">MDN: inert</a><br><br> hierdoor kan de gebruiker niet perongelijk op het element komen.<br> onthoud dat je dan in JavaScript deze attribute moet weg halen en terug plaatsen afhankelijk van de interactie je je probeert te maken.<br> dit kan zo:<br> vb<br> navbar.removeAttribute('inert')<br> navbar.setAttribute('inert')"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "13/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "<a href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/interaction-design.md\">workshop Responsive Interactive Website</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "<a href=\"https://www.dreamerux.com/articles/35y5fyrr4pifhbondc7r636nkvyoqg\">deze animaties/ transitions geanalyseerd</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "tips & tricks",
                            "text": "<a href=\"https://verpex.com/blog/website-tips/how-to-style-a-progress-bar-using-css\">how to style progress element</a> <a href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/10\">bezig geweest met responsiveness</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "14/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "gewerkt aan deze issues",
                            "text": "<a href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/10\">responsiveness afgemaakt</a> <a href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/18\">user story en schetsen gemaaikt voor mijn interaction</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "15/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "<a href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/programming-user-interaction.md\">workshop Programming User Interaction</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "<a href=\"https://medium.com/@ruthiran_b/disneys-motion-principles-in-designing-interface-animations-9ac7707a2b43\">disney animatie principes</a> <a href=\"https://codepen.io/vrsh/pen/qEWKWKY?editors=0110\">interactive button gemaakt met disney principles</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "usefull sites",
                            "text": "<a href=\"https://cubic-bezier.com/#.17,.67,.83,.67\">tranistion timing berekenen</a> oklch kleuren voor transitions, omdat het een grotere kleuren palet heeft. waardoor je transition mooier lijkt <a href=\"https://oklch.com/\">oklch.com</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "3 nieuwe CSS properties die je nog niet kende",
                            "text": "- Oklch is een nieuw kleurenmodel in CSS dat natuurlijke kleuren geeft en meer controle biedt over helderheid, verzadiging en tint dan RGB of hex.<br>- Cubic Bezier is een CSS-timingfunctie die de snelheid van een animatie bepaalt, zodat je kunt kiezen hoe de beweging versnelt of vertraagt."
                        },
                        {
                            "type": "paragraph",
                            "header": "beschrijf 2 animatie principes die je nog niet helemaal begrijpt",
                            "text": "op <a href=\"https://medium.com/@ruthiran_b/disneys-motion-principles-in-designing-interface-animations-9ac7707a2b43\">deze</a> website snap ik nog niet helemaal het verschil tussen \"squash & stretch\" en \"secondary action\". Bij een button lijken ze veel op elkaar, want allebei voegen ze extra beweging toe. Maar hoe ze precies anders zijn, begrijp ik nog niet."
                        },
                        {
                            "type": "paragraph",
                            "header": "beschrijf 1 animatie principe dat je toe gaat voegen aan je eigen I Love Web website.",
                            "text": "ik wil eerst Anticipatie gebruiken door de achtergrond van het menu op beeld te krijgen. Daarna Timing gebruiken om de linkjes achter elkaar, met een kleine delay, op beeld te laten komen."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "16/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "tips & tricks",
                            "text": "voor nav menu kan je inert gebruiken om ervoor te zorgen dat je niet met tab op elementen terecht komt die niet op screen zijn. bijvoorbeeld een nav die je van scherm weg schijf, om het later met een transitie terug te brengen. als het menu niet op screen is dan wil je dat de gebruiker niet perongeluk erbij komt."
                        },
                        {
                            "type": "paragraph",
                            "header": "wat doet inert:",
                            "text": "haalt het element weg van de accessibility terecht. zorgt ervoor dat er niet naar het element ge-tabbed kan worden. het element wordt niet doorzichtig of gaat weg uit de DOM (het gaat niet op display: none)"
                        },
                        {
                            "type": "paragraph",
                            "header": "menu gemaakt die ook werkt zonder js.",
                            "text": "js geeft alle classes die het nodig heeft om op scherm te komen en om ervan weg te gaan. js geeft ook inert voor betere toegankelijkheid. ik heb een skip link button toegevoegd voor screen readers, zodat het gelijk naar de main content kan, en de nav skipt. hover op de linkjes en buttons gezet. <a href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/18\">accessdash interactions</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "17/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Code/Design User Testing",
                            "text": "<a href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/code-design-review-user-testing.md\">workshop</a> <a href=\"https://github.com/fdnd-task/fix-the-flow-interactive-website/blob/main/docs/code-design-review-user-testing.md\">voorbereiding testen</a> <a href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/18#issuecomment-2597733570\">hier heb ik bijgehouden wat ik heb gedaan voor user testing</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "I love web met Dave Bitter",
                            "text": "Dave Bitter is een digital designer bij IO die AI-gedreven voice interfaces ontwikkelt voor het web, met focus op user experience en lage latency.<br><br>7 jaar geleden maakte Dave Bitter de <a href=\"https://presi-parrot.davebitter.com/\">Presiparrot-app</a>, een tool die je woorden omzet naar tekst. Toen was het iets dat nog heel weinig bestond.<br><br>Dave Bitter bouwde met zijn bedrijf AIVA, waarmee hij AI inzet voor voice interactions. Het werkt simpel: je praat, dat wordt omgezet naar tekst met de SpeechRecognition Web API, iets als ChatGPT geeft een antwoord, en dat wordt weer omgezet naar audio met de SpeechSynthesis Web API. Alles bij elkaar zorgt dit voor een soepele en natuurlijke voice-ervaring.<br><br>Dave heeft een <a href=\"https://codepen.io/davebitter/pen/QWYPpax\">SpeechSynthesis-demo</a> gemaakt om te laten horen hoe slecht de audio klinkt. Om het makkelijker en fijner te maken, kun je gebruik maken van een SpeechSynthesizer. Wil je dit zelf proberen? Gebruik dan de gratis AI-powered SpeechSynthesis van ElevenLabs via deze <a href=\"https://elevenlabs.io/?utm_source=google&utm_medium=cpc&utm_campaign=t1_brandsearch_brand_english&utm_id=21809606381&utm_term=elevenlabs&utm_content=brand_exact&gad_source=1&gclid=CjwKCAiAnKi8BhB0EiwA58DA4SrQXHRWsq9srbZvkFEqGmGnP_hzavVb1b5ZnNdGH8C3WKs7Qm-rhhoCI7AQAvD_BwE\">link</a>.<br><br>De audio is nu beter, maar er zijn nog steeds meerdere stappen die zorgen voor een slechte ervaring, zoals latency. De stappen die je laptop moet nemen voordat jij een reactie krijgt: je start op je desktop, stuurt iets naar ChatGPT, het antwoord gaat terug naar je laptop, van daaruit gaat het naar ElevenLabs voor SpeechSynthesis, en dan weer terug naar je laptop. Hoe langer het antwoord, hoe meer latency, en dat verpest de gebruikerservaring.<br>Een voorbeeld van hoe dit werkt:<br>fetch 1, play 1<br>fetch 2, play 2<br>fetch 3, play 3<br><br>Een manier om dit te versnellen, je kan fetchen terwijl je de vorige afspeelt:<br>fetch 1, play 1, fetch 2<br>play 2, fetch 3<br>play 3, fetch 4<br><br>Vaak wordt er gezegd:<br>performance over anything.<br>maar Dave vindt dat<br>\"Nothing breaks the illusion more than high latency\".<br>Hij zegt dit omdat als je te lang moet wachten, de ervaring verpest wordt.<br><br><a href=\"https://techhub.iodigital.com/tags/voice\">Meer informatie over hoe Dave AIVA heeft gemaakt</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "20/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Refactoring en Code Conventions",
                            "text": "<a href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/refactoring-code-conventions.md\">workshop</a> <a href=\"https://github.com/fdnd-task/the-client-website/blob/main/docs/code-conventies.md#geef-je-html-ademruimte\">HTML ademruimte en inspringen</a> <a href=\"https://github.com/fdnd-task/the-client-website/blob/main/docs/code-conventies.md#schrijf-je-css-selectors-in-dezelfde-volgorde-als-de-html\">Volgorde en nesten van CSS selectors</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Refactoring & CSS Nesting",
                            "text": "Vandaag heb ik mijn HTML refactored en CSS beter/meer genest. <a href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/21\">issue waar ik dit heb bijgehouden</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "22/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Tips voor ReadMe schrijven",
                            "text": "<a href=\"https://github.com/fdnd-task/the-startup-responsive-interactive-website/blob/main/docs/wrap-up.md\">tips voor ReadMe schrijven</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "ReadMe en Screenreader Test",
                            "text": "Ik heb vandaag mijn readme afgemaakt en ook een screenreader-test gedaan. Sommige issues heb ik gelijk kunnen oplossen, maar een paar hebben meer tijd nodig. Helaas heb ik niet genoeg tijd om dit voor de sprint review aan te passen <a href=\"https://github.com/vsheo/the-startup-responsive-interactive-website?tab=readme-ov-file#future-ready-design---accessdash\">Accessdash ReadMe</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "23/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Sprint Review",
                            "text": "Vandaag was de sprint review met de opdrachtgever. Mijn screenreader gaf geen geluid. Gelukkig mocht ik de laptop van Arman lenen om de toegankelijkheid van mijn hamburgermenu met de screenreader te laten zien."
                        },
                        {
                            "type": "paragraph",
                            "header": "Probleem met Geluid",
                            "text": "Toen ik thuis kwam, merkte ik dat de YouTube-video's ook geen geluid gaven. Ik heb daarna gekeken naar mijn drivers en zag dat alle drivers die met geluid te maken hadden gedownload moesten worden. Ik had niet door dat ik deze drivers niet had, omdat ik de dag ervoor de screenreader-test had gedaan op een monitor met ingebouwde speakers."
                        },
                        {
                            "type": "paragraph",
                            "header": "Sprint Review Feedback",
                            "text": "Maar apart van dit, was de sprint review goed verlopen. De ontvangen feedback heb ik in <a href=\"https://github.com/vsheo/the-startup-responsive-interactive-website/issues/23\">deze</a> issue opgeschreven"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "24/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Laatste Lesdag en Expo",
                            "text": "Vandaag was de laatste lesdag voor deze sprint. Na de les hadden we een expo. Thuis ben ik begonnen met het schrijven van de retrospects."
                        },
                        {
                            "type": "paragraph",
                            "header": "Retrospects en Nieuwe Interactie",
                            "text": "Naast de retrospects die we voor sprint 6 moeten inleveren, wil ik ook 1.1.3 - Fix the Flow - Interactive Website opnieuw maken. Omdat ik deze sprint weer een interactie heb gemaakt, maar dit keer heb ik het beter laten testen. En doordat ik meer feedback heb gekregen, heb ik ook meer feedback verwerkt."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 6",
                    "title": "The Startup",
                    "date": "25/01/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "Vandaag heb ik de retrospects afgemaakt. Deze week ga ik verder werken aan mijn I Love Web."
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-7",
            "semesterClass": "semester-2-midterm",
            "articles": [
                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "03/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Workshop",
                            "text": "Workshop: <a target=\"_blank\" href=\"https://github.com/fdnd-task/connect-your-tribe-profile-card/blob/main/docs/sprint-planning.md\">Sprint planning</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "JSON Oefening",
                            "text": "Vandaag heb ik tijdens de les ook geoefend met <a target=\"_blank\" href=\"https://github.com/fdnd-task/connect-your-tribe-profile-card/blob/main/docs/sprint-planning.md#oefenen-met-json\">JSON</a> Tijdens deze workshop heb node js geinstalleerd en een hello world pagina gemaakt op http://localhost:3000/"
                        },
                        {
                            "type": "paragraph",
                            "header": "Database en Visitekaartje",
                            "text": "Op deze site kan ik info toevoegen aan een database. Uit deze <a target=\"_blank\" href=\"https://whois.fdnd.nl/admin\">database</a> kan ik info halen en toevoegen aan mijn Visitekaartje voor sprint 7."
                        },
                        {
                            "type": "paragraph",
                            "header": "Projectboard",
                            "text": "Ik heb ook een <a target=\"_blank\" href=\"https://github.com/users/vsheo/projects/10/views/1\">projectboard</a> gemaakt met de planning van programma.fdnd erin."
                        },
                        {
                            "type": "paragraph",
                            "header": "Visitekaartje Ontwerp",
                            "text": "Daarna ben ik alvast begonnen met mijn nieuwe visitekaartje. Breakdown schetsen en begin aan HTML en CSS. <a target=\"_blank\" href=\"https://github.com/fdnd-task/connect-your-tribe-profile-card/blob/main/docs/visitekaartje-met-nodejs.md#visitekaartje-herontwerpen-met-nodejs-en-een-rest-api\">Opdracht</a>, <a target=\"_blank\" href=\"\">Redesign Issue</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "04/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "CSS Challenge",
                            "text": "Css challenge van Sanne: <a target=\"_blank\" href=\"https://github.com/fdnd-task/css-challenges/blob/main/docs/challenge_has.md\">Challenge has</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Mijn Werk",
                            "text": "Mijn werk: <a target=\"_blank\" href=\"https://codepen.io/vrsh/pen/PwYvKaR?editors=1100\">Codepen</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik geleerd?",
                            "text": "Vandaag heb ik de CSS challenge van Sanne gevolgd. Ik heb geleerd over :has() in CSS. Gisteren had ik mijn interactie al een deel gemaakt met JavaScript. Vandaag heb ik geprobeerd hetzelfde met :has() en checkboxes te maken in CSS."
                        },
                        {
                            "type": "paragraph",
                            "header": "Visitekaartje Redesign",
                            "text": "Visitekaartje redesign sprint 7: <a target=\"_blank\" href=\"https://github.com/vsheo/connect-your-tribe-profile-card/issues/4\">Redesign Issue</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "05/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Workshop: REST API en Json, Oefenen met Routes en Views",
                            "text": "Workshop over REST API en Json: <a target=\"_blank\" href=\"https://github.com/fdnd-task/connect-your-tribe-profile-card/blob/main/docs/rest-api-en-json.md\">REST API en JSON</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Tip",
                            "text": "Als je niet meer weet hoe die property van het person object heet (was het nou birthdate of birth_date?), zet <code>{{ person | json }}</code> in je code, en bekijk het antwoord in je pagina."
                        },
                        {
                            "type": "paragraph",
                            "header": "Pro-tip",
                            "text": "Zorg dat je tijdens het bouwen en debuggen standaard ergens op je pagina een custom made fixed positioned <details><summary>Data</summary><pre>{{ person | json:4 }}</pre></details> element hebt—dan kun je altijd even spieken in je data. Haal die alleen wel weg voordat je je werk live zet :)"
                        },
                        {
                            "type": "paragraph",
                            "header": "If Else and For Each met Liquid in HTML",
                            "text": "Meer over if else en for each met Liquid in HTML: <a target=\"_blank\" href=\"https://shopify.dev/docs/api/liquid/tags/conditional-else\">Conditional Else</a> en <a target=\"_blank\" href=\"https://shopify.dev/docs/api/liquid/tags/iteration-tags\">Iteration Tags</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "For Loop met If Statement",
                            "text": "For loop met if statement om data uit een array te halen, en 1 voor 1 in een <code>li</code> plakken."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "06/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "CSS Animatie Verbetering",
                            "text": "Vandaag heb ik de CSS animatie mooier gemaakt, door eerst de achtergrond zonder tekst van buiten beeld naar de laatste plek te brengen met cubic bezier. En nadat die animatie klaar is, een fade in te doen voor de tekst."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "07/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan vandaag?",
                            "text": "Vandaag hadden we code en design reviews, ik heb feedback gegeven aan: <a target=\"_blank\" href=\"https://github.com/Brancovanbeek/connect-your-tribe-profile-card/issues/1#issuecomment-2642497477\">Brancovanbeek</a> <a target=\"_blank\" href=\"https://github.com/RenzoWille/connect-your-tribe-profile-card/issues/2\">RenzoWille</a> <a target=\"_blank\" href=\"https://github.com/Naddybsx/connect-your-tribe-profile-card/issues/5#issuecomment-2642571112\">Naddybsx</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "10/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Sprint Planning en Filter Sort in JSON Browser",
                            "text": "Vandaag heb ik de sprint planning en filter sort in de JSON browser doorgenomen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Links voor filteren, zoeken en sorteren",
                            "text": "Ik heb de volgende links gebruikt voor filteren, sorteren en zoeken in de JSON browser: <a target=\"_blank\" href=\"https://fdnd.directus.app/items/person/?filter={%22bio%22:{%22_contains%22:%22frontend%22}}\">Filteren met bio bevat frontend</a> <a target=\"_blank\" href=\"https://fdnd.directus.app/items/person/?filter={%22fav_color%22:%22%239914e1%22}\">Filteren op favoriete kleur</a> <a target=\"_blank\" href=\"https://fdnd.directus.app/items/person/?search=frisbee\">Zoeken op frisbee</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "DLC - Convergeren en Divergeren",
                            "text": "Door de DLC meerdere keren te doorlopen kan je stap voor stap een ontwerpprobleem, of ontwerpvraag, oplossen. Dit heet convergeren en divergeren. Meerdere ideeën uitwerken en analyseren, daarna keuzes maken om tot de beste oplossing te komen."
                        },
                        {
                            "type": "paragraph",
                            "header": "info over Sorteren, Filteren en Zoeken",
                            "text": "<a target=\"_blank\" href=\"https://directus.io/docs/guides/connect/query-parameters#sort\">Sorteren in JSON Browser</a> <a target=\"_blank\" href=\"https://directus.io/docs/guides/connect/filter-rules\">Filteren in JSON Browser</a> <a target=\"_blank\" href=\"https://directus.io/docs/guides/connect/query-parameters#search\">Zoeken in JSON Browser</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Schetsen gemaakt",
                            "text": "Ik heb vandaag ook verschillende schetsen gemaakt."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "12/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan?",
                            "text": "Vandaag heb ik een nieuwe app.get route gemaakt voor een pagina met gefilterde informatie. In de URL heb ik filter en sort toegepast om specifieke data op te halen. Door filter en sort in de URL toe te passen, kan ik de data dynamisch ophalen en weergeven op de pagina."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "14/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Code & design review",
                            "text": "Vandaag heb ik samen met Kim code- en designreviews geschreven voor: <a href=\"https://github.com/DivaniNL/connect-your-tribe-squad-page/issues/5\">Dylan</a> <a href=\"https://github.com/Brancovanbeek/connect-your-tribe-squad-page/issues/7\">Branco</a> <a href=\"https://github.com/FatimaZelay/connect-your-tribe-squad-page/issues/6\">Fatima</a> <a href=\"https://github.com/halie404/connect-your-tribe-squad-page/issues/3\">Halima</a> <a href=\"https://github.com/Karima002/connect-your-tribe-squad-page-/issues/2\">Karimna</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "14/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "We Love Web met Kilian Valkhof",
                            "text": "Kilian Valkhof begon met websites bouwen toen hij 11 was, met een persoonlijke website gebouwd in Frontpage 2000. In de beginjaren was het internet anders en werkte het soms niet goed in alle browsers. Op 12-jarige leeftijd begon hij geld te verdienen met affiliate marketing en kreeg hij meer ervaring met HTML, CSS, JS en jQuery. Toen de iPhone uitkwam, werd responsive design belangrijk voor het web."
                        },
                        {
                            "type": "paragraph",
                            "header": "Start van een bedrijf en Tools",
                            "text": "Op zijn 16e begon hij samen met medestudenten een bedrijf te runnen, en dit gaf hem veel ervaring in de jaren daarna. Hij bouwde verschillende tools en apps, zoals Trimage voor het optimaliseren van afbeeldingen, en F.lux voor het aanpassen van schermhelderheid."
                        },
                        {
                            "type": "paragraph",
                            "header": "Polypane Browser",
                            "text": "In 2017 besloot hij Polypane te maken, een browser voor developers, omdat hij het frustrerend vond om websites op verschillende apparaten te testen. Hij ontwikkelde Polypane om deze processen te vereenvoudigen en tijd te besparen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Polypane Groei",
                            "text": "In 2018 kreeg hij een dochter, en in 2019 besloot hij fulltime aan Polypane te werken. Na de lancering van versie 1.0 op 14 mei 2019 was Polypane niet meer gratis, wat sommige mensen teleurstelde. Hij werkte hard aan nieuwe features, zoals dark mode en verbeterde lay-outs, en luisterde naar feedback van gebruikers."
                        },
                        {
                            "type": "paragraph",
                            "header": "Technologie en Side-projects",
                            "text": "Polypane bevat nu veel functies die oorspronkelijk niet bestonden in andere browsers, zoals een eigen element inspector en tools om makkelijk grids en afbeeldingen te testen. Wat betreft technologie gebruikt Polypane Electron voor cross-platform apps, en de interface is gebouwd met React (hoewel hij nu misschien een andere keuze zou maken vanwege technische uitdagingen)."
                        },
                        {
                            "type": "paragraph",
                            "header": "Polypane Cloud en Toekomst",
                            "text": "Door aan Polypane te werken, kreeg hij ideeën voor side-projects, zoals Superposition.design (voor contrastproblemen in browsers) en Polypane Cloud (voor website-wide testing). Hij is ook bezig met een Polypane-versie voor iPad."
                        },
                        {
                            "type": "paragraph",
                            "header": "Belang van Side-projects",
                            "text": "Kilian benadrukt het belang van side-projects en dat je niet vast moet komen zitten in één carrièrepad. Hij heeft door het werken aan Polypane veel geleerd en blijft maandelijkse updates brengen voor het product, dat nu bijna 10 jaar oud is. Hij bedankt zijn klanten in release notes wanneer hun feedback wordt gebruikt."
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "24/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Workshop: User Generated Content",
                            "text": "Vandaag heb ik geleerd hoe ik een post route kan maken, zodat de gebruiker bijvoorbeeld iets kan posten op de website en het kan zien als een comment. De workshop was te vinden op: <a href=\"https://github.com/fdnd-task/connect-your-tribe-squad-page/blob/main/docs/user-generated-content.md\" target=\"_blank\">User Generated Content Workshop</a>"
                        },
                        {
                            "type": "paragraph",
                            "header": "Werk aan Issue",
                            "text": "Ik heb gewerkt aan de volgende issue: <a href=\"https://github.com/kimnikitaschijf/connect-your-tribe-team-squad-page/issues/3\" target=\"_blank\">Issue 3</a>"
                        }
                    ]
                },

                {
                    "sprint": "Sprint 7",
                    "title": "Connect Your Tribe",
                    "date": "26/02/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Kleine aanpassingen en code review",
                            "text": "Ik heb een paar kleine aanpassingen gemaakt bij de issue: <a href=\"https://github.com/kimnikitaschijf/connect-your-tribe-team-squad-page/issues/3\" target=\"_blank\">Issue 3</a> en het daarna op review geplaatst."
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat heb ik gedaan?",
                            "text": "Mijn code en die van Kim samengevoegd, en daarna alle 'bugs' eruit gehaald. daarna heb ik Akiko ook geholpen om haar like button samen te voegen met wat ik en Kim al samen gevoegd hadden. Wij wouden een witte like button die rood word als het geklikt werd, dit is ons niet gelukt"
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-8",
            "semesterClass": "semester-2-midterm",
            "articles": [
                {
                    "sprint": "Sprint 8",
                    "title": "Server-Side Rendering",
                    "date": "03/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Ik heb Milledoni gekozen als mijn opdrachtgever. De briefing ontvangen en gelijk de debriefing geschreven."
                        },
                        {
                            "type": "paragraph",
                            "text": "De briefing voorbereid, de debriefing geschreven, en contact gehad met Milledoni via een WhatsApp-groepchat."
                        },
                        {
                            "type": "paragraph",
                            "text": "Hoe kan ik deze week de website voor Milledoni ontwikkelen volgens de richtlijnen van de briefing en de debriefing?"
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target=\"blank\" href=\"https://github.com/fdnd-task/the-client-website/blob/main/docs/briefing-debriefing.md\">Briefing & Debriefing Document</a> <a target=\"blank\" href=\"https://github.com/fdnd-agency/milledoni/tree/main?tab=readme-ov-file\">FDND Milledoni GitHub Repository</a> <a target=\"blank\" href=\"https://docs.google.com/presentation/d/1lksQueJO-YP5XvwbIFyt84sQ4m9N5SNklDMinXbTvjM/edit#slide=id.g323007664e2_0_100\">Milledoni Presentation</a> <a target=\"blank\" href=\"https://www.figma.com/design/tHCHwBm3Ujv7wR28VU2BSu/Milledoni?node-id=0-1&p=f\">Figma Design Milledoni</a> <a target=\"blank\" href=\"https://github.com/fdnd-task/server-side-rendering-server-side-website/blob/main/docs/sprint-planning.md\">Workshop van vandaag</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 8",
                    "title": "Server-Side Rendering",
                    "date": "04/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Ik heb een interface inventory gemaakt."
                        },
                        {
                            "type": "paragraph",
                            "text": "De interface inventory is opgesteld en het template is beschikbaar voor gebruik."
                        },
                        {
                            "type": "paragraph",
                            "text": "Hoe kan ik deze week de interface inventory verder integreren in de ontwikkelingsworkflow?"
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target=\"blank\" href=\"https://github.com/fdnd-task/look-and-feel-corporate-identity/blob/main/docs/styleguide.md#interface-inventory\">Interface Inventory</a> <a target=\"blank\" href=\"https://www.figma.com/design/Tox75iooqru0EvV3iLbkHw/Interface-Inventory?node-id=0-1&node-type=canvas&t=sZLKnogq564gwWdl-0\">Interface Inventory Template</a> <a target=\"blank\" href=\"https://github.com/fdnd-task/look-and-feel-corporate-identity/blob/main/docs/styleguide.md#styleguide-samenstellen\">Styleguide</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 8",
                    "title": "Server-Side Rendering",
                    "date": "05/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Vandaag heb ik gewerkt aan verschillende fetch URL's om data op te halen en te filteren via de Directus API. Ik heb een sitemap gemaakt en geleerd hoe ik fetch URL's kan gebruiken voor zowel algemene als gedetailleerde data, met behulp van filters om lege waarden te vermijden."
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb verder gewerkt aan het begrijpen van hoe je data analyseert en hoe je velden kunt uitbreiden door gelinkte personen te tonen met hun gegevens, zoals namen, images, en andere velden. Ook heb ik gewerkt met base URL's om specifieke velden en gelinkte data te verkrijgen."
                        },
                        {
                            "type": "paragraph",
                            "text": "Hoe kan ik deze week verder werken met de Directus API om de data op een efficiënte manier te verwerken en presenteren?"
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target=\"blank\" href=\"https://github.com/fdnd-task/server-side-rendering-server-side-website/blob/main/docs/templating-met-json.md\">Workshop van vandaag: Data analyseren</a> <a target=\"blank\" href=\"https://github.com/fdnd-task/the-client-website/blob/main/docs/prototyping.md#sitemap\">Sitemap maken</a> <a target=\"blank\" href=\"https://fdnd-agency.directus.app/items/milledoni_products\">Milledoni producten URL</a> <a target=\"blank\" href=\"https://fdnd-agency.directus.app/items/milledoni_products/?fields=name,image,tags\">Index pagina fetch URL</a> <a target=\"blank\" href=\"https://fdnd-agency.directus.app/items/milledoni_products/?fields=name,image,description,url\">Details pagina fetch URL</a> <a target=\"blank\" href=\"https://fdnd-agency.directus.app/items/milledoni_products/?fields=tags&filter[tags][_nnull]\">Andere URL voor tags</a> <a target=\"blank\" href=\"https://fdnd-agency.directus.app/items/milledoni_products/?fields=tags,image,name&filter={\"_or\":[{\"tags\":{\"_neq\":\"null\"}},{\"name\":{\"_neq\":\"null\"}},{\"name\":{\"_neq\":\"null\"}}]}\">Andere fetch URL met OR filter</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 8",
                    "title": "Server-Side Rendering",
                    "date": "07/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Introductie tot GSAP",
                            "text": "vandaag hadden we de we love web met cassie over de animatiebibliotheek GSAP (GreenSock Animation Platform) en geleerd hoe je deze kunt toepassen voor flexibele en krachtige webanimaties. GSAP biedt veel meer controle dan CSS-animaties, met onder andere tweens, timelines, en responsive matchMedia functionaliteiten."
                        },
                        {
                            "type": "paragraph",
                            "header": "Tweens en Timelines",
                            "text": "GSAP gebruikt 'tweens' om individuele animaties te maken, bijvoorbeeld een element horizontaal verplaatsen. Timelines zorgen voor meer controle door meerdere animaties te sequencen zonder handmatig vertragingen te berekenen, iets wat CSS standaard niet ondersteunt."
                        },
                        {
                            "type": "paragraph",
                            "header": "GSAP Utils",
                            "text": "GSAP bevat krachtige utiliteitsfuncties zoals random(), mapRange(), wrap() en pipe(), die animaties natuurlijker en dynamischer maken. Zo kun je eenvoudig willekeurige kleuren genereren of elementen eindeloos laten bewegen over het scherm."
                        },
                        {
                            "type": "paragraph",
                            "header": "Easing en Yoyo",
                            "text": "Met easing kun je bepalen hoe een animatie versnelt of vertraagt. Dankzij progressie en yoyo-functionaliteit kun je animaties bijvoorbeeld laten terugkeren naar de startpositie of reageren op hoveracties met een in- en uitgaande animatie."
                        },
                        {
                            "type": "paragraph",
                            "header": "Responsieve animaties met matchMedia",
                            "text": "GSAP ondersteunt matchMedia waarmee je animaties kunt afstemmen op mediaqueries zoals schermgrootte of pointer-type. Dit maakt het mogelijk om bijvoorbeeld bewegingsintensiteit aan te passen voor gebruikers met 'reduce motion'-instellingen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Animatiecontrole",
                            "text": "Met TimeScale kun je animaties versnellen of vertragen, vergelijkbaar met een videospeler. GSAP biedt ook helperfuncties die inspelen op veelvoorkomende uitdagingen, zoals animatie-pauses en interactie met sliders of knoppen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Geavanceerde animatiefuncties",
                            "text": "ScrollTrigger maakt het mogelijk om animaties te koppelen aan scrollacties, en met de Motion Path Helper kun je objecten langs een zelf getekend pad laten bewegen. Deze tools geven veel creatieve vrijheid bij het ontwerpen van interactieve ervaringen."
                        },
                        {
                            "type": "paragraph",
                            "header": "Samenwerking met Webflow",
                            "text": "GSAP is recentelijk overgenomen door Webflow, wat de ontwikkeling en ondersteuning van de library heeft versterkt. Voorheen werd het onderhouden door slechts twee personen, maar nu is er meer ruimte voor groei en innovatie."
                        },
                        {
                            "type": "paragraph",
                            "header": "Voorbeelden en inspiratie",
                            "text": "Op gsap.com/demos zijn er veel voorbeelden te vinden die laten zien hoe veelzijdig GSAP is. Deze demo’s zijn handig om inspiratie op te doen en zelf aan de slag te gaan met animaties."
                        }
                    ]
                },
                {
                    "sprint": "Sprint 8",
                    "title": "Server-Side Rendering",
                    "date": "07/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Tijdens de workshop van vandaag heb ik gewerkt met data filtering en template filters in Directus. Ik heb verschillende experimenten uitgevoerd waarbij ik data filter op naam, geboortedatum en favoriete tags."
                        },
                        {
                            "type": "paragraph",
                            "text": "Workshop documentatie: <a target=\"blank\" href=\"https://github.com/fdnd-task/server-side-rendering-server-side-website/blob/main/docs/data-filtering-en-template-filters.md\">Data Filtering & Template Filters</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Experiment 1: Ik wil alle studenten gesorteerd op name <a target=\"blank\" href=\"https://fdnd.directus.app/items/person/?fields=name&sort=name\">Link</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Experiment 2: Ik wil alle names van studenten die een name hebben die begint met de letter D <a target=\"blank\" href=\"https://fdnd.directus.app/items/person/?fields=name&sort=name&filter={%20%22name%22:%20{%20%22_istarts_with%22:%20%22D%22%20}%20}\">Link</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Experiment 3: Ik wil alle names van studenten die een name hebben die begint met de letter D of K <a target=\"blank\" href=\"https://fdnd.directus.app/items/person/?fields=name&sort=name&filter={%22_or%22:[{%22name%22:{%22_istarts_with%22:%22d%22}},{%22name%22:{%22_istarts_with%22:%22k%22}}]}\">Link</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Experiment 4: Ik wil alle names en birthdates van studenten die een birthdate hebben ingevuld <a target=\"blank\" href=\"https://fdnd.directus.app/items/person/?fields=name,birthdate&filter={%22_and%22:[{%22name%22:{%22_neq%22:%22null%22}},{%22birthdate%22:{%22_neq%22:%22null%22}}]}\">Link 1</a> <a target=\"blank\" href=\"https://fdnd.directus.app/items/person/?fields=name,birthdate&filter={%22_and%22:[{%22name%22:{%22_nnull%22:%22true%22}},{%22birthdate%22:{%22_nnull%22:%22true%22}}]}\">Link 2</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 8",
                    "title": "Server-Side Rendering",
                    "date": "14/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "Ik heb geen probleem met de huidige indeling van de studio. Het kan soms druk zijn, maar als ik eenmaal bezig ben met coderen, lukt het me goed om geconcentreerd te blijven. Thuis studeren vind ik soms handiger, vooral omdat ik daar met twee schermen werk. Toch blijf ik liever in de studio als ik veel te doen heb, omdat ik daar het meeste gedaan krijg. Als ik 's middags moet werken, ga ik na de les naar huis."
                        },
                        {
                            "type": "paragraph",
                            "header": "Analyse van de studio",
                            "text": "We hebben samen gekeken naar wat goed gaat in de studio en wat beter kan. Op het whiteboard hebben we dit overzicht gemaakt:"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat gaat goed?",
                            "text": "1. in de studio kunnen we samenwerken\n2. Aquarium is lekker koel\n3. Vier personen per tafel is een fijne bezetting"
                        },
                        {
                            "type": "paragraph",
                            "header": "Wat kan beter?",
                            "text": "1. Soms is er teveel geluid in de ruimte\n 2. De studio wordt soms te warm\n3. Er is geen plek voor meer dan 4 personen per tafel"
                        },
                        {
                            "type": "paragraph",
                            "text": "Nieuwe indeling voor studio en aquarium geschetsed"
                        },
                        {
                            "type": "paragraph",
                            "header": "House rules voor een prettige werkomgeving",
                            "text": "Ruim je plek op als je klaar bent"
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-9",
            "semesterClass": "semester-2-midterm",
            "articles": [
                {
                    "sprint": "Sprint 9",
                    "title": "The Web is for Everyone",
                    "date": "17/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Vandaag hadden we een workshop over user generated content. We leerden hoe we progressive enhancement kunnen toepassen door eerst de core functionaliteit te bepalen, te starten met eenvoudige technieken zoals HTML en mobile-first CSS, en daarna verder te verbeteren met JavaScript."
                        },
                        {
                            "type": "paragraph",
                            "text": "We bespraken ook wat een goede website maakt: hij moet responsief, toegankelijk, performant en progressively enhanced zijn. Ik heb daarnaast schetsen en een wireflow gemaakt voor een user story voor Milledoni."
                        },
                        {
                            "type": "paragraph",
                            "text": "Hoe kan ik de bookmark-functionaliteit voor Milledoni bouwen volgens het principe van progressive enhancement?"
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target=\"blank\" href=\"https://github.com/fdnd-task/the-web-is-for-everyone-interactive-functionality/blob/main/docs/user-generated-content.md\">Workshop User Generated Content</a> <a target=\"blank\" href=\"https://github.com/vsheo/the-web-is-for-everyone-interactive-functionality/issues/15\">Wireflow voor User Story</a> <a target=\"blank\" href=\"https://fdnd-agency.directus.app/items/milledoni_users?fields=*.*\">Post URL voor Milledoni Bookmarklijst</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 9",
                    "title": "The Web is for Everyone",
                    "date": "19/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Ik geleerd over UI states en bepaald welke ik ga toepassen op mijn project. Daarnaast heb ik een werkende form gebouwd met de POST-method. Hiermee kan een gebruiker een cadeau toevoegen aan een lijst of het verwijderen door opnieuw te klikken."
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik zal de volgende UI states gebruiken: een loading state bij het openen van de detailpagina (door een loading circle te tonen), een empty state bij het eerste laden van de pagina (met een geblurde afbeelding die daarna scherp wordt), en een error state voor als de data niet laadt (met een foutmelding)."
                        },
                        {
                            "type": "paragraph",
                            "text": "Hoe kan ik zorgen dat mijn interface op elk moment een bruikbare en toegankelijke state toont, ongeacht wat er met de data gebeurt?"
                        },
                        {
                            "type": "paragraph",
                            "header": "Verwijzingen:",
                            "text": "<a target=\"blank\" href=\"https://www.scotthurff.com/posts/why-your-user-interface-is-awkward-youre-ignoring-the-ui-stack/#ideal\">Uitleg over UI States</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 9",
                    "title": "The Web is for Everyone",
                    "date": "20/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "ik heb gewerkt aan deze issues:"
                        },
                        {
                            "type": "paragraph",
                            "text": "<a target=\"blank\" href=\"https://github.com/vsheo/the-web-is-for-everyone-interactive-functionality/issues/17\">routes voor oplsaan in een bookmark lijst</a> <a target=\"blank\" href=\"https://github.com/vsheo/the-web-is-for-everyone-interactive-functionality/issues/18\">bookmark overzicht & bookmarked cadeau pagina</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 9",
                    "title": "The Web is for Everyone",
                    "date": "21/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Ik heb mijn bookmark list interactie gepresenteerd tijdens de stand-up. Kyan uit 1H heb ik laten zien hoe ik met een POST items toevoeg aan de database. Daarnaast heb ik Renzo geholpen met het opzetten van zijn GET en POST routes. Ook heb ik een loader gemaakt die op beeld verschijnt nadat er op een link geklikt wordt."
                        },
                        {
                            "type": "paragraph",
                            "text": "De eerste issue ging over het verbeteren van de empty state en het toevoegen van een fallback voor als data niet beschikbaar is. De tweede issue richtte zich op het tonen van feedback aan de gebruiker na een actie (zoals toevoegen of verwijderen van een item)."
                        },
                        {
                            "type": "paragraph",
                            "text": "Hoe kan ik mijn interacties nog intuïtiever maken voor gebruikers, zonder afbreuk te doen aan performance en toegankelijkheid?"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 9",
                    "title": "The Web is for Everyone",
                    "date": "23/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Ik heb de loading bar afgemaakt. <a target=\"blank\" href=\"https://github.com/vsheo/the-web-is-for-everyone-interactive-functionality/issues/20\">Issue 20</a> Nieuwe issue gemaakt vopor mn back button, omdat het nu terug gaat naar de home pagina en niet naar de vorige pagina. <a target=\"blank\" href=\"https://github.com/vsheo/the-web-is-for-everyone-interactive-functionality/issues/21\">Issue 21</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 9",
                    "title": "The Web is for Everyone",
                    "date": "24/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Ik heb gewerkt aan feature detection en geleerd hoe je code kunt gebruiken afhankelijk van de ondersteuning van de browser. Ik heb de @supports regel gebruikt om CSS-declaraties te specificeren die afhankelijk zijn van de browserondersteuning voor CSS-functies. <a target=\"blank\" href=\"https://developer.mozilla.org/en-US/docs/Learn_web_development/Extensions/Testing/Feature_detection\">Feature Detection</a>, <a target=\"blank\" href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/@supports\">@supports</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb een progressieve enhancement toegepast door de core functionaliteit eerst te maken en daarna de enhancements maken voor gebruikers van modernere browsers. <a target=\"blank\" href=\"https://developer.mozilla.org/en-US/docs/Glossary/Progressive_Enhancement\">Progressive Enhancement</a>"
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb de code getest in verschillende browsers en ervoor gezorgd dat de basisfunctionaliteit werkt voor de meeste gebruikers, terwijl ik extra functionaliteit toevoeg voor gebruikers met moderne browsers. <a target=\"blank\" href=\"https://codepen.io/vrsh/pen/WbNyJqw?editors=1100\">CodePen voorbeeld</a>."
                        },
                        {
                            "type": "paragraph",
                            "text": "Verder heb ik de core functionaliteit voor tekst en audio getest en geoptimaliseerd, en een FAQ-sectie en carrousel gemaakt voor de deeltaak."
                        }
                    ]
                },
                {
                    "sprint": "Sprint 9",
                    "title": "The Web is for Everyone",
                    "date": "28/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Wat heb je gedaan?",
                            "text": "Tijdens de code en design review heb ik feedback gegeven aan <a target=\"blank\" href=\"https://github.com/Sebastiaan-hva/the-web-is-for-everyone-interactive-functionality/issues/9\">Sebastiaan</a> <a target=\"blank\" href=\"https://github.com/Saif8599/the-web-is-for-everyone-interactive-functionality/issues/9\">Saif</a> <a target=\"blank\" href=\"https://github.com/MarsGotBars/the-web-is-for-everyone-interactive-functionality/issues/15\">Marcin</a>"
                        }
                    ]
                },
                {
                    "sprint": "Sprint 9",
                    "title": "We Love Web met Ischa Gast",
                    "date": "28/03/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Toegankelijkheidsproblemen",
                            "text": "Ischa bespreekt het belang van toegankelijkheid op het web voor mensen met verschillende beperkingen. Er wordt ingegaan op visuele, auditieve, cognitieve en ouderdomsbeperkingen en hoe deze de gebruikerservaring kunnen beïnvloeden. Bijvoorbeeld, te veel of te weinig contrast kan problematisch zijn voor visueel beperkte gebruikers."
                        },
                        {
                            "type": "paragraph",
                            "header": "Oplossingen voor Toegankelijkheid",
                            "text": "Om websites toegankelijker te maken, is het belangrijk om goede HTML en koppenstructuur te gebruiken. Duidelijke linktekst is essentieel, evenals voldoende contrast. Ook moeten websites visuele feedback bieden voor de tabindex om navigatie met het toetsenbord te vergemakkelijken."
                        },
                        {
                            "type": "paragraph",
                            "header": "Voorbeeld van problemen",
                            "text": "Ischa deelde een voorbeeld van een collega die moeite had met het boeken van een ticket op een website, omdat de hulplink moeilijk te vinden was, helemaal onderaan de pagina. Ook gaf Ischa het voorbeeld van een kleurblinde persoon die Coolblue niet goed kan gebruiken vanwege de kleurkeuzes, maar wel Bol.com, die betere contrasten biedt."
                        },
                        {
                            "type": "paragraph",
                            "header": "Screenreader en toegankelijkheid",
                            "text": "Ischa benadrukt het belang van doorzichtige tekst voor screenreaders, zodat de inhoud wel leesbaar is voor mensen met een visuele beperking, maar niet zichtbaar voor normale gebruikers. Sven, die blind is, kan bijvoorbeeld op wedstrijdniveau gamen dankzij geluiden die elke beweging aangeven."
                        },
                        {
                            "type": "paragraph",
                            "header": "voorbeelden",
                            "text": "Een voorbeeld werd gedeeld van Schiphol, waar een assistentiebutton niet effectief was voor dove mensen, aangezien de enige optie was om met iemand te praten. Daarnaast had de HEMA website geen visuele feedback voor de tabindex, waardoor het moeilijk was om met het toetsenbord te navigeren."
                        },
                        {
                            "type": "paragraph",
                            "header": "Zelfstandige benadering van Ischa",
                            "text": "Ischa maakt zelf websites toegankelijk, zelfs wanneer de klant daar niet specifiek om vraagt, wat bijdraagt aan een meer inclusieve gebruikerservaring."
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-10",
            "semesterClass": "semester-2-endterm",
            "articles": [
                {
                    "sprint": "sprint 10",
                    "title": "Sprint Planning en Reflecties",
                    "date": "14/4/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Sprint Planning",
                            "text": [
                                "De ",
                                {
                                    "anchor": "sprint planning",
                                    "href": "https://github.com/fdnd-task/user-experience-enhanced-website/blob/main/docs/sprint-planning.md",
                                    "class": "a-inline"
                                },
                                " is opgesteld in de project board."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Sprint 9 Feedback",
                            "text": "De feedback uit sprint 9 is omgezet in losse issues:"
                        },
                        {
                            "type": "list",
                            "header": "Issues",
                            "text": [
                                {
                                    "anchor": "Issue 1",
                                    "href": "https://github.com/vsheo/user-experience-enhanced-website/issues/1"
                                },
                                {
                                    "anchor": "Issue 2",
                                    "href": "https://github.com/vsheo/user-experience-enhanced-website/issues/2"
                                },
                                {
                                    "anchor": "Issue 3",
                                    "href": "https://github.com/vsheo/user-experience-enhanced-website/issues/3"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Progressive Enhancement",
                            "text": [
                                "Ik heb gekeken naar welke progressive enhancement-componenten ik in deze sprint wil maken. Mijn doel is om elke week één component te ontwikkelen: "
                            ]
                        },
                        {
                            "type": "list",
                            "header": "Component issues",
                            "text": [
                                {
                                    "anchor": "Issue 4",
                                    "href": "https://github.com/vsheo/user-experience-enhanced-website/issues/4"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Workshop: Performance",
                            "text": [
                                "De ",
                                {
                                    "anchor": "performance workshop",
                                    "href": "https://github.com/fdnd-task/user-experience-enhanced-website/blob/main/docs/performance.md",
                                    "class": "a-inline"
                                },
                                " is gevolgd."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Break the Web",
                            "text": "Ik heb onderzoek gedaan voor de opdracht Break the Web:"
                        },
                        {
                            "type": "list",
                            "header": "Onderzoek en presentatie",
                            "text": [
                                {
                                    "anchor": "Onderzoek in de wiki",
                                    "href": "https://github.com/vsheo/i-love-web/wiki/sprint-10:-break-the-web-opdracht"
                                },
                                {
                                    "anchor": "Presentatie",
                                    "href": "https://docs.google.com/presentation/d/17Bk9n4BWrym93VX8d7geexIlbbmX90hzyDMVm_c8evk/edit?slide=id.g34bac3c03a9_2_45#slide=id.g34bac3c03a9_2_45"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Web Vitals Metrics",
                            "text": "Web Vitals is een meetsysteem dat door Google is ontwikkeld om de snelheid en prestaties van websites inzichtelijk te maken."
                        },
                        {
                            "type": "paragraph",
                            "header": "Core Web Vitals",
                            "text": "De Core Web Vitals zijn de drie belangrijkste statistieken die de gebruikerservaring meten op het gebied van performance:"
                        },
                        {
                            "type": "list",
                            "header": "De drie statistieken",
                            "text": [
                                {
                                    "text": "Loading performance"
                                },
                                {
                                    "text": "Interactivity"
                                },
                                {
                                    "text": "Visual stability"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Inzicht in gebruikerservaring",
                            "text": "Deze statistieken geven inzicht in hoe goed de gebruikerservaring is tijdens het laden en gebruiken van de website."
                        },
                        {
                            "type": "paragraph",
                            "header": "Drie manieren om te testen",
                            "text": "Lighthouse – Voor snel inzicht in de prestaties van je website op jouw apparaat."
                        },
                        {
                            "type": "paragraph",
                            "text": "PageSpeed Insights – Geeft inzicht in prestaties voor een breder publiek, met data van echte gebruikers."
                        },
                        {
                            "type": "paragraph",
                            "text": "WebPageTest (waterfall charts) – Biedt een diepgaande analyse van alles wat er in de browser gebeurt tijdens het laden van de pagina."
                        }
                    ]
                },
                {
                    "sprint": "sprint 10",
                    "title": "User Experience",
                    "date": "22/4/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Workshop van vandaag",
                            "text": [
                                "Workshop van vandaag: ",
                                {
                                    "anchor": "perceived performance",
                                    "href": "https://github.com/fdnd-task/user-experience-enhanced-website/blob/main/docs/perceived-performance.md",
                                    "class": "a-inline"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": [
                                {
                                    "anchor": "Cheating The UX",
                                    "href": "https://stephaniewalter.design/blog/cheating-ux-perceived-performance-and-user-experience/",
                                    "class": "a-inline"
                                },
                                " manieren om de website sneller laten lijken voor de gebruiker"
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Visual time response",
                            "text": "De volgende tijdsintervallen beschrijven hoe gebruikers reactietijd ervaren:"
                        },
                        {
                            "type": "list",
                            "text": [
                                {
                                    "text": "Instant response <300ms: Als een interactie niet langer duurt dan 300 miliseconden ervaart de gebruiker dat als 'instant response', de interface reageert direct. Dit geldt bijvoorbeeld voor button states zoals :hover en :focus."
                                },
                                {
                                    "text": "Normal Delay 300ms - 2s: Als een interactie of het laden van content sneller gaat dan 2 seconden, is er geen extra feedback nodig. De gebruiker zal dan niet het gevoel krijgen dat iets te lang duurt."
                                },
                                {
                                    "text": "System is thinking 2 - 5s: Als het laden van content langer duurt dan 2 seconden, dan zal je de gebruiker feedback moeten geven dat er iets gebeurt, zoals een loading spinner."
                                },
                                {
                                    "text": "Do something extra >5s: Duurt een interactie of het laden van content langer dan 5 seconden? Dan zul je de gebruiker duidelijk moeten maken waarom iets zo lang duurt. Bijvoorbeeld bij het uploaden van content zorg je ervoor dat in de interface duidelijk is wat er gebeurt en hoe lang het nog duurt."
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Illusies en slimme animaties",
                            "text": [
                                "Ease-out animaties\n",
                                "Gebruik Ease-out animaties als de interface direct moet reageren, zoals voor button states en het menu."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": [
                                "Ease-in animaties\n",
                                "Gebruik Ease-in animaties voor het tonen van informatie zoals prompt, modal, succes states en error meldingen"
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Progress bar",
                            "text": [
                                "Als je een progress bar naar het einde toe laat versnellen, zal de gebruiker het gevoel krijgen dat iets sneller is geladen."
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 10",
                    "title": "User Experience",
                    "date": "23/4/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "DPR & Viewport",
                            "text": [
                                "DPR betekent Device Pixel Ratio, dat is eigenlijk hoe scherp je scherm pixels weergeeft. Wil je weten wat jouw viewport of dpt is? Check dan even deze site: ",
                                {
                                    "anchor": "whatismyviewport.com",
                                    "href": "https://whatismyviewport.com/",
                                    "class": "a-inline"
                                },
                                ". Super handig om te snappen hoe je site zich aan verschillende schermen aanpast."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Responsive Images",
                            "text": [
                                "Als je een website bouwt, wil je natuurlijk dat je afbeeldingen er goed uitzien op elk apparaat zonder onnodig veel data te gebruiken. Deze gids dat uit: ",
                                {
                                    "anchor": "Responsive Images The Simple Way",
                                    "href": "https://cloudfour.com/thinks/responsive-images-the-simple-way/",
                                    "class": "a-inline"
                                },
                                ". Ook CSS heeft een tool hiervoor: ",
                                {
                                    "anchor": "image-set",
                                    "href": "https://developer.mozilla.org/en-US/docs/Web/CSS/image/image-set",
                                    "class": "a-inline"
                                },
                                ", daarmee kun je verschillende resoluties makkelijk instellen."
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 10",
                    "title": "User Experience",
                    "date": "06/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Workshop van vandaag",
                            "text": [
                                "Vandaag hebben we gewerkt aan client-side scripting voor betere gebruikerservaring. Check de uitleg hier: ",
                                {
                                    "anchor": "Client-Side Scripting for UX",
                                    "href": "https://github.com/fdnd-task/user-experience-enhanced-website/blob/main/docs/client-side-scripting-for-ux.md",
                                    "class": "a-inline"
                                },
                                "."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "View Transitions",
                            "text": [
                                "View transitions zijn een mooie manier om overgangen tussen paginas of states soepel en vloeiend te maken."
                            ]
                        },
                        {
                            "type": "list",
                            "text": [
                                {
                                    "anchor": "Getting Started with View Transitions",
                                    "href": "https://daverupert.com/2023/05/getting-started-view-transitions/",
                                    "class": "a-inline"
                                },
                                {
                                    "anchor": "View Transitions Handling Aspect Ratio Changes",
                                    "href": "https://jakearchibald.com/2024/view-transitions-handling-aspect-ratio-changes/",
                                    "class": "a-inline"
                                }
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 10",
                    "title": "We Love Web met Niels Leenheer",
                    "date": "25/4/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Introductie",
                            "text": [
                                "Niels Leenheer werkt bij een bedrijf dat kassasystemen maakt voor kapsalons, maar hij is van oorsprongkelijk webdeveloper. Zijn achtergrond is half informatica en half kunstacademie. Vroeger werden webontwikkelaars vaak webmasters genoemd. Zijn eerste website bestond uit een afbeelding van He-Man en een noscript tag."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Eerste ervaringen met het web",
                            "text": [
                                "De noscript tag toont content wanneer JavaScript niet beschikbaar is. Je kunt meerdere noscript tags plaatsen, maar een noscript binnen een andere telt als één. Deze tag is niet te stylen omdat hij niet gerenderd wordt als JavaScript uitstaat. De inhoud komt wel in de DOM maar blijft onzichtbaar. Dit maakt noscript een uniek HTML-element."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Resilience van HTML",
                            "text": [
                                "HTML is tolerant voor fouten en blijft meestal werken ondanks onjuiste code. Browsers negeren onbekende of foutieve tags zonder foutmelding. Dit zorgt ervoor dat het web toegankelijk is. Javascript is minder tolerant en kan door fouten stoppen met werken."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Geschiedenis en fundamenten van het web",
                            "text": [
                                "Tim Berners-Lee maakte de eerste browser die ook een editor was. Hiermee kon je websites maken en bekijken. Oude websites werken nog steeds omdat browsers onbekende tags negeren. Backwards compatibility is een kernprincipe van HTML. Zelfs browsers als Mosaic tonen nog steeds websites zonder CSS en JavaScript."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Verouderde en oude HTML-tags",
                            "text": [
                                "Sommige oude tags zoals blink zijn verdwenen uit moderne browsers. Dit effect is nu alleen na te maken met CSS of JavaScript. De marquee tag wordt nog wel ondersteund maar nauwelijks gebruikt. Dit laat zien dat niet alle oude tags backward compatible zijn. De meeste oude tags worden wel netjes genegeerd."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Hoe werkt het parsen van HTML?",
                            "text": [
                                "Browsers gebruiken een tokenizer en tree builder om HTML te verwerken. De tokenizer leest HTML teken voor teken en maakt tokens aan. De tree builder bouwt de DOM en vult ontbrekende tags aan. Verkeerd geneste tags worden gecorrigeerd door de browser. Zo zorgt de browser dat fouten niet zichtbaar zijn."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Aanbevelingen voor moderne webontwikkeling",
                            "text": [
                                "Gebruik standaard HTML-elementen zoals button in plaats van custom elementen. Dit verbetert compatibiliteit en toegankelijkheid. Veel mensen delen content via platforms als Facebook en Instagram. Daardoor bepaalt een klein aantal bedrijven wat gebruikers zien. Dit maakt het web minder open dan vroeger."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Moderne uitdagingen in webontwikkeling",
                            "text": [
                                "Frameworks en polyfills helpen nieuwe functies in oudere browsers te ondersteunen. Dit werkt echter alleen tot een bepaald punt. Het fundament van HTML zorgt dat oude content nog steeds zichtbaar is. Moderne browsers zijn tolerant en herstellen veel fouten. Zo blijft het web ook na tientallen jaren bruikbaar."
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 10",
                    "title": "Nodemon opzetten",
                    "date": "23/4/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "Download de nieuwste versie van Node.js (https://nodejs.org/en) op je laptop of computer."
                        },
                        {
                            "type": "paragraph",
                            "text": "Fork deze repository en Clone jouw fork naar je laptop."
                        },
                        {
                            "type": "paragraph",
                            "text": "Open de repository in Visual Studio Code (of een andere code editor)."
                        },
                        {
                            "type": "paragraph",
                            "text": "Open de terminal in VSCode en installeer node in de repository:"
                        },
                        {
                            "type": "list",
                            "text": [
                                { "text": "npm install" },
                                { "text": "npm install -D nodemon" }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": "Controleer of je deze code in je package.json hebt staan:"
                        },
                        {
                            "type": "list",
                            "text": [
                                { "text": "\"scripts\": {" },
                                { "text": "  \"start\": \"node server.js\"," },
                                { "text": "  \"dev\": \"nodemon server.js\"" },
                                { "text": "}" }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": "Zodra de installatie klaar is, voer je het volgende commando uit om de website op localhost te starten:"
                        },
                        {
                            "type": "paragraph",
                            "text": "Voor gewone start, waarbij je de server handmatig opnieuw moet opstarten bij wijzigingen:"
                        },
                        {
                            "type": "list",
                            "text": [{ "text": "npm start" }]
                        },
                        {
                            "type": "paragraph",
                            "text": "Als je de server start met nodemon, wordt de server automatisch opnieuw gestart bij wijzigingen in server.js:"
                        },
                        {
                            "type": "list",
                            "text": [{ "text": "npm run dev" }]
                        },
                        {
                            "type": "paragraph",
                            "text": "Na het starten zie je in de terminal een localhost-link. Klik erop of open deze in je browser."
                        },
                        {
                            "type": "paragraph",
                            "text": "Als je de server wilt stoppen, dan kan dat met deze command:"
                        },
                        {
                            "type": "list",
                            "text": [{ "text": "Ctrl + C" }]
                        }
                    ]
                }
            ]
        },

        {
            "slug": "sprint-11",
            "semesterClass": "semester-2-endterm",
            "articles": [
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "12/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Workshop sprint planning",
                            "text": [
                                "Workshop over sprint planning gedaan. Link naar de uitleg: ",
                                {
                                    "anchor": "sprint planning",
                                    "href": "https://github.com/fdnd-task/pleasurable-ui/blob/main/docs/sprint-planning.md",
                                    "class": "a-inline"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "wat heb ik gedaan? / ga ik doen?",
                            "text": [
                                "Vandaag wil ik de single page view transition van deze workshop proberen te verwerken in mijn website: ",
                                {
                                    "anchor": "client-side scripting for UX",
                                    "href": "https://github.com/fdnd-task/user-experience-enhanced-website/blob/main/docs/client-side-scripting-for-ux.md",
                                    "class": "a-inline"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "",
                            "text": "Mijn portflow van sprint 10 nog een keer overlezen en ingeleverd."
                        },
                        {
                            "type": "paragraph",
                            "header": "",
                            "text": [
                                "Samen met Nadia en Akiko de sprint planning gemaakt. Issue: ",
                                {
                                    "anchor": "sprint planning",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/2",
                                    "class": "a-inline"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "",
                            "text": [
                                "Project board aangemaakt, deadlines aangegeven, must-have en nice-to-have verdeeld en issues toegewezen: ",
                                {
                                    "anchor": "project board",
                                    "href": "https://github.com/users/vsheo/projects/14/views/1",
                                    "class": "a-inline"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "server js",
                            "text": [
                                "Ik heb de fetch URL geschreven ",
                                {
                                    "anchor": "issue 28",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/28",
                                    "class": "a-inline"
                                },
                                ", en de POST en GET routes gemaakt op een branch. Daarna een pull request aan gevraagd het team: ",
                                {
                                    "anchor": "pull request",
                                    "href": "https://github.com/vsheo/pleasurable-ui/pull/36",
                                    "class": "a-inline"
                                }
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "13/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Route voor favoriete pagina",
                            "text": [
                                "Ik heb een route aangemaakt voor de favoriete pagina. Issue: ",
                                {
                                    "anchor": "issue 33",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/33",
                                    "class": "a-inline"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Opslaan en verwijderen van bookmarks",
                            "text": [
                                "Een functie geschreven waarmee bookmarks opgeslagen of verwijderd kunnen worden. Issue: ",
                                {
                                    "anchor": "issue 38",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/38",
                                    "class": "a-inline"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Server DRY maken",
                            "text": "De server is nu DRY geschreven omdat we herbruikbare functies hebben om POST en DELETE acties uit te voeren, en ook een functie om alle bookmarks op te halen."
                        }
                    ]
                },
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "14/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Workshop over feature branches en pull requests",
                            "text": [
                                "Vandaag hebben we gewerkt met feature branches en pull requests. Uitleg is hier te vinden: ",
                                {
                                    "anchor": "Feature Branches en Pull Requests",
                                    "href": "https://github.com/fdnd-task/pleasurable-ui/blob/main/docs/feature-branches-en-pull-requests.md",
                                    "class": "a-inline"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Issue opgelost",
                            "text": [
                                "Ik heb een issue opgelost die Nadia voor mij had gemaakt: ",
                                {
                                    "anchor": "issue 41",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/41",
                                    "class": "a-inline"
                                }
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "15/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Eigen issue en pull request",
                            "text": [
                                "Ik heb gewerkt aan deze issue: ",
                                {
                                    "anchor": "Issue #5",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/5",
                                    "class": "a-inline"
                                },
                                ". Na het afronden heb ik meteen een pull request gemaakt en de ontvangen feedback direct verwerkt."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Reviews op team pull requests",
                            "text": [
                                "Ik heb ook pull requests van mijn teamleden gereviewd:",
                                {
                                    "anchor": "Pull Request van Nadia",
                                    "href": "https://github.com/vsheo/pleasurable-ui/pull/48",
                                    "class": "a-inline"
                                },
                                " en ",
                                {
                                    "anchor": "Pull Request van Akiko",
                                    "href": "https://github.com/vsheo/pleasurable-ui/pull/46",
                                    "class": "a-inline"
                                },
                                "."
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "16/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Code en design review",
                            "text": [
                                "Samen met Nadia heb ik een code en design review geschreven voor ",
                                {
                                    "anchor": "bieb in bloei 1H",
                                    "href": "https://github.com/saschavanvliet/pleasurable-ui/issues/25",
                                    "class": "a-inline"
                                },
                                "."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Branch samengevoegd namens Akiko",
                            "text": [
                                "Akiko was ziek, dus ik heb samen met Nadia haar branch code verwerkt en samengevoegd met onze code op de home pagina:",
                                {
                                    "anchor": "Pull request 53",
                                    "href": "https://github.com/vsheo/pleasurable-ui/pull/53",
                                    "class": "a-inline"
                                },
                                ", ",
                                {
                                    "anchor": "Pull request 50",
                                    "href": "https://github.com/vsheo/pleasurable-ui/pull/50",
                                    "class": "a-inline"
                                },
                                " en ",
                                {
                                    "anchor": "Pull request 54",
                                    "href": "https://github.com/vsheo/pleasurable-ui/pull/54",
                                    "class": "a-inline"
                                },
                                "."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Documentatie",
                            "text": "Ik heb alvast de server.js uitgelegd in de readme."
                        }
                    ]
                },
                {
                    "sprint": "sprint 10",
                    "title": "Pleasurable UI",
                    "date": "19/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Workshop pleasurable user interface",
                            "text": [
                                "De workshop over pleasurable user interface kun je hier vinden: ",
                                {
                                    "anchor": "workshop pleasurable user interface",
                                    "href": "https://github.com/fdnd-task/pleasurable-ui/blob/main/docs/pleasurable-is-in-the-details.md",
                                    "class": "a-inline"
                                },
                                "."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Interacties in Figma ontwerpen",
                            "text": [
                                "Pleasurable UI ontwerpen workshop: ",
                                {
                                    "anchor": "interacties in figma ontwerpen opdracht",
                                    "href": "https://github.com/fdnd-task/pleasurable-ui/blob/main/docs/pleasurable-is-in-the-details.md#pleasurable-ui-ontwerpen",
                                    "class": "a-inline"
                                },
                                "."
                            ]
                        },
                        {
                            "type": "paragraph",
                            "header": "Disney animatie principes",
                            "text": [
                                "Ik heb deze ",
                                {
                                    "anchor": "Disney animatie principes",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/57",
                                    "class": "a-inline"
                                },
                                " gekozen voor een button interactie en daarna een prototype gemaakt in Figma."
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "20/5/25",
                    "content": [
                        {
                            "type": "list",
                            "header": "Figma prototypes gemaakt voor:",
                            "text": [
                                {
                                    "anchor": "micro interactie",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/70"
                                },
                                {
                                    "anchor": "pleasurable laag",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/73"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": [
                                "En begonnen met de html, basis css en js voor de carousel onderaan op de details pagina. Zie issue ",
                                {
                                    "anchor": "#15",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/15",
                                    "class": "a-inline"
                                },
                                "."
                            ]
                        }
                    ]
                },
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "21/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "Ik heb gewerkt in feature branches aan:"
                        },
                        {
                            "type": "list",
                            "text": [
                                {
                                    "anchor": "bookmark loader",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/79"
                                },
                                {
                                    "anchor": "CSS carrousel",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/80"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik moet nog de view transition van de home naar de details pagina maken."
                        }
                    ]
                },
                {
                    "sprint": "kalok yeung insights",
                    "title": "Over Kalok Yeung",
                    "date": "01/06/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "header": "Over Kalok Yeung",
                            "text": "Kalok Yeung is een designer die veel samenwerkt met front-end developers om het design van websites te verbeteren. Hij focust op gebruikservaring en hoe je interacties met de gebruiker emotioneel kunt versterken."
                        },
                        {
                            "type": "paragraph",
                            "header": "Oxytocine triggeren met design",
                            "text": "Kalok legt uit dat je via design oxytocine kunt triggeren, een hormoon dat zorgt voor verbondenheid en vertrouwen. Dit bereik je bijvoorbeeld door zachte UI-elementen: afgeronde hoeken, voldoende witruimte tussen en binnen elementen. Dit zorgt voor een professionele en aangename uitstraling. Ook subtiele motion zoals hover effecten en overgang animaties verbetert de interactie en het gevoel bij de gebruiker."
                        },
                        {
                            "type": "paragraph",
                            "header": "Motion en soft UI",
                            "text": "Beweging moet functioneel zijn en iets toevoegen aan de gebruikerservaring, niet alleen decoratief. Subtiele animaties bij klikken of hoveren maken interacties prettiger. Door herbruikbare elementen te gebruiken, kan je animaties consistent toepassen, bijvoorbeeld een animatie die een subtitel verandert van h2 naar h1 tijdens een view transition. Physics in animaties, zoals een natuurlijke vertraging bij het verslepen van een video-tijdlijn, zorgt voor een organisch gevoel."
                        },
                        {
                            "type": "paragraph",
                            "header": "Geluid in design",
                            "text": "Geluid wordt vaak over het hoofd gezien, maar het kan een positieve impact hebben op de gebruikerservaring. Bijvoorbeeld subtiele geluiden bij het hoveren of klikken op buttons, of een tik-geluid bij het scrollen door een lijst. Deze geluiden versterken de beleving en maken de website memorabel."
                        },
                        {
                            "type": "paragraph",
                            "header": "Content en interactie",
                            "text": "Om ervoor te zorgen dat mensen content lezen, is het belangrijk om tekst niet als grote blokken aan te bieden. Een chat-achtige interface werkt goed, waarbij vragen en antwoorden visueel gescheiden zijn. Ook interactieve filters, bijvoorbeeld op basis van hoe iemand zich voelt, maken content persoonlijker. Complexe processen kunnen simpel worden gemaakt, bijvoorbeeld door een camera op een bonnetje te richten en alleen relevante feedback te tonen, zoals prijs en currency"
                        },
                        {
                            "type": "paragraph",
                            "header": "AI en creativiteit",
                            "text": "Kalok gebruikt AI alleen voor het beantwoorden van e-mails, niet voor ontwerpen. Hij gelooft dat AI geen echte creativiteit kan vervangen omdat ontwerpen die door AI gemaakt worden vaak levenloos aanvoelen."
                        }
                    ]
                },
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "25/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "In het weekend heb ik gewerkt aan:"
                        },
                        {
                            "type": "list",
                            "text": [
                                {
                                    "anchor": "you may also like gedeelte op de details pagina",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/15"
                                },
                                {
                                    "anchor": "CSS carrousel",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/80"
                                },
                                {
                                    "anchor": "where to find table",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/13"
                                },
                                {
                                    "anchor": "error 404 pagina",
                                    "href": "https://github.com/vsheo/pleasurable-ui/issues/18"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": "Deze issues heb ik afgerond en op review geplaatst. De feedback heb ik al verwerkt. Morgen begin ik samen met het team met het mergen."
                        }
                    ]
                },
                {
                    "sprint": "sprint 11",
                    "title": "Pleasurable UI",
                    "date": "26/5/25",
                    "content": [
                        {
                            "type": "paragraph",
                            "text": "Voorbeeld ontwerp keuzes overbrengen:"
                        },
                        {
                            "type": "list",
                            "text": [
                                {
                                    "anchor": "voorbeeld 1",
                                    "href": "https://github.com/users/lisagjh/projects/13/views/14?visibleFields=%5B%22Title%22%2C%22Status%22%2C%22Labels%22%2C133392529%2C133392554%2C%22Parent+issue%22%2C184698587%5D&pane=issue&itemId=111038260&issue=lisagjh%7Ci-love-web%7C261"
                                },
                                {
                                    "anchor": "voorbeeld 2",
                                    "href": "https://github.com/users/lisagjh/projects/13/views/14?pane=issue&itemId=111743727&issue=lisagjh%7Ci-love-web%7C270"
                                }
                            ]
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb de sticky header issue aangenomen en afgemaakt:"
                        },
                        {
                            "type": "paragraph",
                            "text": "Ik heb de structuur van de README gemaakt, de inhoudsopgave, en wat ik kon invullen heb ik al gedaan. Ik wacht nog op mergen omdat mijn code in branches staat, maar ik wacht nog op reviews voordat ik het naar de main kan mergen."
                        },
                        {
                            "type": "paragraph",
                            "text": "README",
                            "anchor": "README",
                            "href": "https://github.com/vsheo/pleasurable-ui#milledoni"
                        }
                    ]
                }
            ]
        }
    ]
}