{
    "articles": [
        {
            "title": "Sprint 1: Your Tribe",
            "date": "4/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "header": "wat heb ik vandaag gedaan?",
                    "text": "vandaag heb ik een breakdown schets gemaakt dat is een schets van de website die ik wil bouwen. met daarin elementen die ik zou kunnen gebruiken."
                },
                {
                    "type": "paragraph",
                    "text": "Ik heb ook gewerkt aan mijn visitekaartje. Ik heb een list toegevoegd mbv. dt en dd Deze tags waren in de template code. Ik heb ze nu aangepast en op een nieuwe manier ingedeelt m.b.v. een ul."
                },
                {
                    "type": "paragraph",
                    "header": "Wat wil ik nog uitzoeken:",
                    "text": "in mijn list als ik hover over text wil ik een pop up tevoorschijn laten komen. In die pop up wil ik vertellen hoe ik de programeertaal heb geleerd en hoe goed ik ben daarin"
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a href='./assets/visitekaart/breakdown_schets_v1.jpg'>breakdown schets 1 en 2</a><a href='./assets/visitekaart/breakdown_schets_v2.jpg'>breakdown schets 3</a>"
                }
            ]
        },

        {
            "title": "Sprint 1: Your Tribe",
            "date": "8/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Vandaag heb ik gewerkt aan mijn I love web. Ik heb de structuur ingedeeld. Ik wil nog niet teveel zetten omdat ik weet dat ik meer zal leren over html en css. Ik wil niet vanaf het begin iets hebben dat moeilijk te lezen is, daarom heb ik het voor nu simpel gehouden."
                },
                {
                    "type": "paragraph",
                    "text": "Ik heb nu een home pagina, en een semester pagina waar alle sprints voor semester 1 staan. Ik kan nu mijn day journal bijhouden en foto's toevoegen."
                },
                {
                    "type": "paragraph",
                    "text": "Ik ben van plan om elke dag screenshots te maken voor een time vault, zodat ik kan zien hoe de website door de dagen heen veranderd."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='blank' href='./assets/i_love_web/home_v1.png'>Home pagina versie 1</a>"
                }
            ]
        },

        {
            "title": "Sprint 1: Your Tribe",
            "date": "9/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Wat hebben we gedaan? team gemaakt met Dylan en Colin voor de squad page groeps opdracht. op <a href='https://miro.com/app/board/uXjVKh1tR08=/'>miro</a> doelen en regels voor het project gemaakt"
                },
                {
                    "type": "paragraph",
                    "text": "iedereen heeft een paar breakdown schetsen gemaakt. Daarna hebben we overlegd en geprobeerd om de ideeën van elkaar te combineren voor een final versie van de breakdown schetsen"
                },
                {
                    "type": "paragraph",
                    "text": "Daarna ben ik alvast begonnen met het bouwen van de squad page. Ik heb nu de grid layout voor onze foto's."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='blank' href='./assets/squad_page/squad_page_breakdown_v1.jpg'>breakdown schets squad page individueel</a><a target='blank' href='./assets/squad_page/squad_page_breakdown_v3.jpg'>breakdown schets squad page samengevoegd</a><a target='blank' href='./assets/squad_page/squad_page_v1.png'>squad page versie 1</a>"
                }
            ]
        },

        {
            "title": "Sprint 1: Your Tribe",
            "date": "10/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "wat heb ik geleerd? Ik heb geleerd waarvoor ik grid kan gebruiken en hoe ik grid beter kan indelen. 2 dingen interessant? Ik heb voorheen alleen met grid-template-columns grid-template-rows gewerkt. Daarna heb ik alles individuëel ingedeeld. Maar nu weet ik dat ik met grid-template-areas, hetzelfde makkelijker kan doen."
                },
                {
                    "type": "paragraph",
                    "text": "Ik ging heel vaak div gebruiken in mijn code, Maar ik heb nu door dat dat bijna niet nodig is. i.p.v een div te gebruiken geef ik nu een class aan het element waar ik mee werk."
                },
                {
                    "type": "paragraph",
                    "text": "wat wil ik nog doen? een pagina maken waar ik al mijn foto's kan laten zien. en dan kan ik vanuit mijn journal naar de foto's linken, waar dat nodig is."
                }
            ]
        },

        {
            "title": "Sprint 1: Your Tribe",
            "date": "11/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "wat heb ik geleerd? Responsive maken voor telefoon en tablets met mediaqueries"
                },
                {
                    "type": "paragraph",
                    "text": "dingen die ik interessant vond? Je kan media query nesten i.p.v helemaal onderaan in je code. Zo kan je code overzichtelijk blijven."
                },
                {
                    "type": "paragraph",
                    "text": "Waaraan heb je gewerkt vandaag? Vandaag hebt ik aan een layout voor een foto collage gewerkt met grid. De indeling is af. Ik heb met mijn team foto's gemaakt rond Hva amstel campus. De foto's zijn in de meeste gevallen te klein voor de grid vakjes die ik nu heb. De grid moet ik nu aanpassen naar de formaat van de foto's."
                },
                {
                    "type": "paragraph",
                    "text": "Ik heb ook gewerkt aan een side scroller. Ik heb geprobeerd het zonder JavaScript te maken, dat was wel gelukt. Maar ik kreeg het niet op de juiste plek. Uiteindelijk heb ik wel JavaScript gebruikt, maar mijn JavaScript is wel heel simpel gebleven."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='_blank' href='https://divaninl.github.io/squad-page/Viresh/index_v.html'>Side scroller</a>"
                }
            ]
        },

        {
            "title": "Sprint 1: Your Tribe",
            "date": "12/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Ik heb vandaag gewerkt aan een campus pagina voor de squad page. hierin willen we locatien van amstelcampus met openingstijden en locaties van de HvA gebouwen en toevoegen."
                },
                {
                    "type": "paragraph",
                    "text": "Ik moet meer met class gaan werken, vooral als je samen gaat werken met anderen. Ik probeerde vandaag mijn code toe te voegen met die van Dylan. Maar omdat ik met header, article, ul, en li ging werken, ontstonden er problemen met onze css. Ik moet nu mijn html en css aanpassen zodat ik het later makkelijker kan samenvoegen met de code van mijn teammates."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='_blank' href='./assets/squad_page/campus_page_v1.png'>campus pagina</a>"
                },
                {
                    "type": "paragraph",
                    "text": "ideeen voor mijn eigen i love web: https://vasilis.nl/"
                }
            ]
        },

        {
            "title": "Sprint 1: Your Tribe",
            "date": "13/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Vandaag heb ik gewerkt aan de opmaak van mijn squad page. Ik had met de html checker 2 problemen gevonden in mijn code, die heb ik ook gelijk opgelost."
                },
                {
                    "type": "paragraph",
                    "text": "Wat wil ik nog doen? Ik wil mijn css voor I love web aanpassen, zodat alles aangepast wordt met class naam i.p.v de tag naam. Ik wil ook aan mijn afbeeldingen page beginnen."
                }
            ]
        },
        
        {
            "title": "Sprint 1: Your Tribe",
            "date": "14/9/24 en 15/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Ik heb vandaag mijn html class names gegeven. Nu zal ik geen problemen meer hebben als ik bijvoorbeeld een nieuwe grid of tabel een andere stijl wil geven."
                },
                {
                    "type": "paragraph",
                    "text": "Ik heb een web pagina gemaakt waar ik mijn foto's kan laten zien. Deze pagina is af, ik moet alleen nog foto's toevoegen."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='_blank' href='./assets/i_love_web/picture_vault_v1.1.png'>Foto pagina v1</a>"
                }
            ]
        },
        
        {
            "title": "Sprint 1: Your Tribe",
            "date": "16/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Ik heb met figma gewerkt. Nu heb ik mijn squad page nagemaakt. wat ik nog moet doen is, nieuwe versies met verschillende kleuren en lettertypes maken. Ik heb geleerd hoe ik met figma kan werken. Nu weet ik dat figma heel handig is om verschillende concepten te maken, en ze met elkaar vergelijken."
                }
            ]
        },

        {
            "title": "Sprint 1: Your Tribe",
            "date": "17/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "We zijn bezig geweest met mergen voor de squad page. Vandaag heb ik aan de campus pagina gewerkt. De informatie die op de pagina komt heb ik al toegevoegd. Ik ben nog niet helemaal tevreden met de stijl van mijn grid, daar zal ik morgen verder aan werken. De kleuren moeten ook nog aangepast worden, maar daarvoor moet ik nog overleggen met Dylan en Colin."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='_blank' href='./assets/squad_page/campus_page_v2.1.png'>Campus pagina v1</a>"
                },
                {
                    "type": "paragraph",
                    "text": "Vandaag hadden we ook een CSS college. Daarna hadden we 2 oefeningen met css transities en transformaties. De eerste heb ik af, met de tweede moet ik nog beginnen."
                }
            ]
        },
        
        {
            "title": "Sprint 1: Your Tribe",
            "date": "18/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Vandaag heb ik de campus pagina voor onze squad page afgemaakt. Er was een klein probleem in mijn grid, waardoor een stuk tekst niet te zien was. Dat is nu opgelost. Ik had ook een probleem met de foto's, ze waren niet allemaal even groot. Dat heb ik kunnen oplossen met min-width, min-height en object-fit: cover. Ik heb ook aan de tabellen op de detailpagina gewerkt, die zijn ook af. Als laatst had ik vandaag de campus pagina ook responsive gemaakt."
                },
                {
                    "type": "paragraph",
                    "text": "Wat wil ik nog doen? Er zijn een paar foto's op de detailpagina die in de breedte zijn gemaakt. Op die plekken hebben we portretfoto's nodig. Morgen zal ik een paar nieuwe foto's maken."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='blank' href='./html/p_squadpage.html#final_squad'>Squad page final</a>"
                }
            ]
        },
        
        {
            "title": "Sprint 1: Your Tribe",
            "date": "19/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Vandaag heb ik het laatste probleem met visitekaartje opgelost. De terugflip werkte niet, omdat backface-visibility op hidden stond, waardoor ik niet opnieuw kon klikken om de kaart terug te draaien. Nu heb ik in JavaScript een timer van 4 seconden ingesteld. Na die 4 seconden draait mijn visitekaartje automatisch terug. De transities heb ik ook wat vloeiender gemaakt op mijn visitekaartje. Als laatste heb ik mijn I love web aangevuld met foto's en daily check-outs."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='blank' href='https://vsheo.github.io/your-tribe-profile-card/'>Visitekaart final</a>"
                }
            ]
        },
        
        {
            "title": "Sprint 1: Your Tribe",
            "date": "20/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Vandaag heb ik de foto's op mijn Picture Vault-pagina beter geordend. Ik heb ook alle foto's en screenshots die ik nog miste toegevoegd. Daarnaast heb ik links vanuit mijn journal naar de Picture Vault toegevoegd. Ik ben nog niet helemaal tevreden met de indeling van de Picture Vault-pagina. Ik ben van plan om een paar foto's te verwijderen en de rest per sprint in te delen, zodat de pagina sneller laadt."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='blank' href='./html/p_visitekaart.html'>link naar mijn picture vault visitekaart</a><a target='blank' href='./html/p_iloveweb.html'>link naar mijn picture vault i love web</a><a target='blank' href='./html/p_squadpage.html'>link naar mijn picture vault squad page</a>"
                }
            ]
        },

        {
            "title": "Sprint 1: Your Tribe",
            "date": "21/9/24",
            "content": [
                {
                    "type": "paragraph",
                    "text": "Ik heb vandaag nieuwe fotopagina's gemaakt. In plaats van één pagina met alle foto's, heb ik nu één pagina per opdracht (visitekaart, I love web, squad page). Ik heb ook meteen de links van mijn journalpagina naar de foto's gemaakt. Hiervoor heb ik 'id' tags gebruikt."
                },
                {
                    "type": "paragraph",
                    "header": "Verwijzingen:",
                    "text": "<a target='blank' href='./html/p_visitekaart.html'>link naar mijn picture vault visitekaart</a><a target='blank' href='./html/p_iloveweb.html'>link naar mijn picture vault i love web</a><a target='blank' href='./html/p_squadpage.html'>link naar mijn picture vault squad page</a>"
                }
            ]
        }        
    ]
}
